#ifndef	__T9MB_h__
#define	__T9MB_h__

//"拼音输入法汉字排列表"
const unsigned char PY_mb_space [] = {""};
const unsigned char PY_mb_a[]=  {"啊阿吖呵腌嗄锕錒"};
const unsigned char PY_mb_ai[]=  {"爱唉哎艾挨矮癌埃哀碍愛暧嗳隘霭捱蔼皑嫒噯瑷嗌毐欸僾薆嬡壒鑀砹敳礙曖锿啀璦瞹娭藹譪呆溾昹騃靄皚鴱溰餲乂乃伌儗凒剀剴叆呃呝嘊噫堨塧奇娾嵦懓懝敱欬濭烠焥皧硋磑絠諰譺賹躷醷鎄閡阂阨阸隑靉馤鯦鱫"};
const unsigned char PY_mb_an[]=  {"按俺安案暗岸鞍氨庵胺黯铵谙桉唵闇垵盦儑侒鹌犴埯厂广揞荌鮟諳銨錌豻萻韽啽峖腤馣雸鵪匼厈咹垾堓婩媕屽干晻洝玵痷盒盫碪罯菴葊蓭裺誝貋遃鉗钳陰隂隌鞌頇頞顸鴳鶕"};
const unsigned char PY_mb_ang[]=  {"昂盎肮昻骯醠仰卬岇枊醃"};
const unsigned char PY_mb_ao[]=  {"奥熬澳傲凹敖袄嗷獒拗坳鳌岙螯翱遨骜媪懊奧璈鏊鏖廒奡芺聱鰲謷墺擙襖鼇镺扷嶴岰滶隞爊蔜柪艹厫嗸噢嚣嚻囂垇墽媼嫯嶅慠抝摮梎棍泑浇澆澚熝獓眑磝磽礉翶翺蝹謸軪郩鏕驁鴁鴢鷔"};
const unsigned char PY_mb_b[]=	 {"不部本鲍柏毕变比并别百报步办表"};
const unsigned char PY_mb_ba[]=  {"吧把八爸巴拔罢霸坝扒芭疤靶捌叭灞跋耙粑钯笆茇岜魃罷仈鲅犮菝壩矲癹豝胈覇朳抜弝蚆釟軷釛鼥伯叐哱哵坺垻墢夿妭峇抪捭杷柭欛湃炦玐皅笩紦羓茷萆詙跁鈀颰魞鮁鮊鲃鲌丷"};
const unsigned char PY_mb_bai[]=  {"白百摆拜败柏掰呗佰伯挀稗敗擺捭粺栢粨擘拝竡唄庍扒排派猈絔薜薭襬贁鞁鞴韛"};
const unsigned char PY_mb_ban[]=  {"办版半班板般搬伴斑扮拌瓣绊扳颁坂阪辦钣瘢攽癍闆湴粄頒舨絆蝂柈姅昄鈑怑鉡靽螁魬斒並分坢埿岅彬搫朌瓪秚籓肦螌褩覂豳跘辧辨辩辬辯鳻"};
const unsigned char PY_mb_bang[]=  {"帮棒榜邦浜绑磅傍镑蚌谤膀幫梆幇垹綁旁蒡謗塝鞤鎊搒縍玤艕峀並嗙埲嫎崗幚彭徬挷捠棓牓硥稖紡纺蚄蛖蜯螃邫騯髈"};
const unsigned char PY_mb_bao[]=  {"包报宝抱保爆暴饱薄堡鲍煲豹胞曝苞褒葆宀孢寶勹雹報菢寳刨飽剥鸨龅鮑褓儤瀑趵笣窇蕔媬珤鑤鴇虣炮齙怉靤駂鳵忁髱飹佨剝勽呆嘐嚗堢嫑寚曓枹砲簿緥藵蚫袌袍裒裦襃賲鉋铇闁靌骲"};
const unsigned char PY_mb_bei[]=  {"被呗北背倍杯贝备悲碑卑辈蓓焙惫钡悖陂備孛唄狈臂貝碚盃輩偝珼邶鹎褙鞴琲牬鐾庳椑誖鋇揹鞁桮憊襬梖狽骳藣糒鄁鵯犕埤萆俻俾偹僃哱喺垻怫愂昁杮柸棑棓波痺禙箃苝茀菩萯葡蛽蜚諀跋軰鉳錍鐴"};
const unsigned char PY_mb_ben[]=  {"本笨奔苯锛贲渀犇畚坌夯錛泍栟体倴喯夲奙捹撪桳楍炃燌獖翉蟦賁輽逩鐼"};
const unsigned char PY_mb_beng[]=  {"泵蹦崩甭绷迸嘣蚌繃伻甏祊埲琫菶塴嵭閍俸傍傰唪嗙埄堋奟平抨挷搒旁榜漨熢琣痭絣綳跰逬錋鏰镚鞛"};
const unsigned char PY_mb_bi[]=  {"比必笔逼币俾碧毕壁避鼻闭彼臂弊屄畀璧毙辟蔽弼痹敝庇鄙吡婢滗陛荜铋匕濞哔妣薜篦筆湢楅蓖芘嬖髀妼毖畢秕苾彃襞繴閉裨箅佖跸嬶泌愎筚幣堛萆斃躄睥贲閟荸疪詖狴柀賁粊庳獙沘邲痺嗶皕觱秘潷珌綼閇蹕匂舭縪愊幤怭鄪髲坒篳鏎廦獘腷贔蓽貏疕熚罼朼駜蜌奰襣鄨飶鮅鵖鷩鼊梐馝鷝驆滭埤仳佊佛偪卑咇啚复夶娝媲崥幅庀弻怶悂拂捭旇服枇枈柲椑檗殍毴波煏畁畐皀瞥禆稫笓箃箄箆粃紕紴纰罷翍聛肶肸胇脾腗萞蘗虑螕袐被襅诐豍貱費费赑跛踾躃鈚鉍錍鎞鐴鐾閈闬陂陴鞁鞞鞸韠饆馥魓魮鮩鰏鲾鴓鶝鸊"};
const unsigned char PY_mb_bian[]=  {"便边变遍编扁辩鞭辨贬卞辫匾煸弁變苄邊汴編砭変釆褊笾忭辯蝙邉鳊貶抃箯碥缏窆籩辮髟辧萹揙艑豍惼甂汳峅稨鴘封徧拚昪炞牑猵獱疺稹糄緶臱藊覍覵辡辦邲鍽閞鞕頨鯾鯿鶣"};
const unsigned char PY_mb_biao[]=  {"表标彪飙飚镖膘裱婊骠镳杓灬標飑摽俵錶鳔飆儦諘藨褾驃鑣熛鏢瘭猋滮檦贆爂墂髟瀌臕飇鰾僄剽嫖幖徱淲漂穮篻脿膔苞蔈謤鏖颮颷飈飊驫骉麃"};
const unsigned char PY_mb_bie[]=  {"别憋鳖瘪別蹩彆鱉咇蟞柲癟鼈虌襒徶蛂扒拔捌撆撇柭猰秘穪苾莂蔽龞"};
const unsigned char PY_mb_bin[]=  {"斌彬宾滨鬓镔濒殡缤槟殯摈玢膑豳髌賓傧儐邠濱鬢繽瀕蠙擯濵臏虨椕髕鑌霦份氞汃浜瑸璸砏訜豩賔贇赟頻顮频髩鬂"};
const unsigned char PY_mb_bing[]=  {"并病冰兵饼丙柄炳秉並禀氷摒幷邴屏餅槟併鞞昺偋掤抦稟垪倂棅餠竝寎梹檳苪誁陃窉庰怲鞆蛃鋲栟仌傡冫平拼昞枋栤燷燹琕痭癛癝眪絣綆绠跰鈵鉼靐鞸鮩"};
const unsigned char PY_mb_bo[]=  {"波博播拨伯薄啵剥搏柏勃泊膊驳卜钵玻脖铂癶帛渤舶跛箔菠亳撥钹簸擘僰剝礴魄礡孛浡踣鎛愽檗缽饽駁鹁駮嶓蘗狛蔔詙簙譒僠鈸犦襮鉢糪秡瓝懪欂鋍胉葧鉑鑮餺蹳餑郣挬鱍鵓掰趵仢佛侼募哱噃嚗壆妭孹帗彴怕拍拔擗暴服柭桲榑檘殕泼淿湐潑潘瀑煿爆牔犻猼瓟番發白百皪盋砵碆磻穛笩箥簿紴肑般艊艴苩茀茷菩蒲蔢蕃薜蘖蚾袚袯袹襎襏豰跑镈馎馛馞驋髆髉鮁鮊鲅鲌"};
const unsigned char PY_mb_bu[]=  {"不部补布步卜捕簿埠卟吥哺怖钚補逋歩堡佈埔瓿晡钸咘鸔鳪鈽餔醭蔀誧踄峬篰轐僕勏埗婄尃庯廍悑抪拊捗捬撲擈柨歨溥獛秿箁荹薄輹郶鈈附陠鞴餢鯆鵏"};
const unsigned char PY_mb_c[]=   {"产成程陈蔡曹崔楚褚池仇晁岑从此处车场传厂才次查"};
const unsigned char PY_mb_ca[]=  {"擦拆礤嚓礸傪囃攃橴磣蔡遪"};
const unsigned char PY_mb_cai[]=  {"才菜猜踩蔡采彩财材裁睬財戝採婇偲綵棌寀埰跴縩倸啋扐揌纔"};
const unsigned char PY_mb_can[]=  {"惨残餐参灿蚕惭璨粲殘慘參骖孱憯燦黪蠶慚飡驂慙澯黲嬠掺傪儏叄叅喰嘇噆囋嬱嵾戔摲朁淺湌爘穇篸薒蝅蠺謲蹔鏒飱鯵鰺鲹"};
const unsigned char PY_mb_cang[]=  {"藏仓苍舱沧倉蒼滄伧艙臧欌鑶獊嵢凔仺傖匨濸瑲篬罉蔵螥賶鶬鸧"};
const unsigned char PY_mb_cao[]=  {"草操曹槽肏艹糙嘈漕嶆螬艸艚騲襙曺傮屮愺慅慒懆撡澡蓸褿造鄵鏪鐰鼜"};
const unsigned char PY_mb_ce[]=  {"测侧册策厕恻側憡測冊廁惻萴蓛厠墄嫧帻幘拺敇柵栅畟笧筞筴箣簎粣荝萗赦齰"};
const unsigned char PY_mb_cen[]=  {"岑涔参梣嵾參叄叅汵硶穇笒篸膥"};
const unsigned char PY_mb_ceng[]=  {"曾层蹭噌層嶒驓僧增橧竲繒缯"};
const unsigned char PY_mb_ch[]=  {"差长常昌超陈程城持重出初"};
const unsigned char PY_mb_cha[]=  {"差查茶插叉察茬搽岔碴槎檫汊杈诧姹镲嚓刹衩楂偛侘锸鍤猹査馇垞喳嗏臿奼靫疀蹅艖紁仛剎土岎嵖扠扱挿捈捷接揷摖斜梌秅肞芆苴荖荼褨訍詧詫釵銟鎈鑔钗餷"};
const unsigned char PY_mb_chai[]=  {"拆柴差钗豺犲侪虿瘥釵儕喍蠆祡袃囆勑叉扠搓查茈茝蔕訍齜龇"};
const unsigned char PY_mb_chan[]=  {"产缠禅铲颤馋掺蝉婵谗搀蟾澶阐忏煘觇谄蒇潺躔禪鑱单廛產儳顫孱羼纏瀍鋋劖蟬襜巉辿摻懺瀺饞冁讒棎毚丳闡摲諂湹鏟嬋骣剷産嵼灛幨旵蕆壥梴纒繟懴滻簅囅嚵幝獑磛酁艬鋓镡亶佔僝僤儃兎兔刬剗単厘啴單嘽團墠嬗崭嶃嶄憚掸摌撣攙斺榐欃沾浐渐漸潹燀硟緂緾繵胀脠苫螹蟺袩裣裧襌襝覘誗譂讇讖谶蹍鄽醦鉆镵閳韂"};
const unsigned char PY_mb_chang[]=  {"长唱常厂场昌尝肠畅偿娼倡敞長昶怅嫦場苌嘗猖徜阊廠鲳伥氅菖裳鬯暢償腸倘鋹嚐萇悵厰僘惝錩甞韔蟐膓椙淐裮琩鯧鋿鱨鼚仧倀儻兏塲尙尚晿棖淌焻玚瑒瑺瓺畼脹誯鏛锠镸閶闛鲿"};
const unsigned char PY_mb_chao[]=  {"超炒朝吵抄潮巢钞绰嘲焯晁牊耖剿鈔怊弨巣漅眧鄛罺巐轈窲仦仯劋勦唠嘮摷槱樔欩涛濤焣煼粆紹綤綽縐繛绉绍觘訬謅謿诌趠趫麨鼂鼌"};
const unsigned char PY_mb_che[]=  {"车扯撤彻澈車掣坼徹偖砗尺迠硨硩撦烢莗伡俥勶呫唓喢多夛奲宅屮揊摰斥池烲焎爡瞮聅蛼詀謵頙"};
const unsigned char PY_mb_chen[]=  {"陈趁沉晨尘臣辰称衬琛嗔宸郴谌陳抻忱谶瞋碜塵伧龀榇傖襯讖棽疢沈蔯踸諃煁茞諶莐磣嚫墋贂螴肜鷐賝樄揨麎齔侲儭堪塡填夦帘愖捵敐曟枕桭棧櫬湛瀋烥疹瘎瘨眈硶稱綝縝缜胂莀薼訦謓謲趂趻跈軙迧醦鈂鍖闖闯霃齓"};
const unsigned char PY_mb_cheng[]=  {"成称城呈程乘撑诚承橙澄秤丞盛逞惩骋稱铖棖塍埕悜誠蛏瞠偁脭撐琤裎柽宬枨澂酲郕珹懲牚橕掁荿铛珵棦峸騁鋮庱檉碀蟶筬赬浾騬溗竀饓鏿噌乗伥侱倀僜净呛嗆埩堘塖娍嵊徎徴徵憆憕抢挰搶摚摤撜敞朾椉槍樘橖檙氶泟洆浈浧淨瀓瀞爯瑲畻盯睈矃穪窚絾緽脀虰觕赪趟踜蹦郢醒鎗鏳鐺阷靗頳鯎黨"};
const unsigned char PY_mb_chi[]=  {"吃持池迟赤尺齿痴驰翅耻斥炽弛叺彳敕叱嗤螭匙豉侈哧墀饬湁笞篪呎蚩鸱茌遲啻魑媸黐褫傺歯瘛恥齒馳絺坻摛癡熾勅懘喫瘈踟鶒眵鉓妛荎抶攡淔痸遅鴟遫蚇瞝謘漦瓻鉹鵄鷘翨胣腟岻貾饎齝麶佁侙俿剟卙卶呬呮呹哆啸喜嘨嘯噄噭坘垑奓她屟彨彲徲恜慗慸憏扡抬拆拕拖拸捇提搋摴杘柅柢樆欼歗歭汖沱沶治泜滞滯灻烾狋痓眙祇离移竾筂箈箎粚糦翄翤耛肔胝胵脪芪茬莉菭蚳蛇蝭袲袳裭訵誀誃誺謻赿趍趐趩跅跢跮踅踶軧迡迣遟邌銐鍉離雴飭飾餝饰騺驪骊鳷鵣鶗鶙"};
const unsigned char PY_mb_chong[]=  {"冲重充虫宠崇翀铳舂衝沖憧忡蟲蹖寵种艟茺銃珫罿隀浺憃偅傭僮喠嘃埫崈徸揰摏樁涌漴潼烛爞痋盅祌種緟茧蝩褈蹱酮"};
const unsigned char PY_mb_chou[]=  {"抽丑臭愁仇筹畴瞅稠酬绸俦踌醜雠惆瘳籌栦疇讎篘吜犨綢菗絒帱殠讐杻杽雔燽躊懤嬦丒侴偢儔嚋圳妯婤媿幬怞扭掫揄搊擣椆檮溴牰犫畤皗盩眣矁紬䌷臰薵裯詶謅譸诌诪跾遚酧醔醻鈕钮魗鮘鯈鲋"};
const unsigned char PY_mb_chu[]=  {"出处除初楚触储厨褚畜雏锄杵橱亍処處怵矗刍础滁黜楮蹰濋绌樗俶躇滀搐儊儲絀齣敊憷觸芻廚貙雛櫥摴蜍歜篨蒢鋤斶鶵耡礎豖趎犓懨蒭幮鄐珿躕臅檚琡傗助嘼埱媰岀慉拀摢柠椘榋槒橻櫉櫖欪涂淑炪璴硫祝禇竌竐絮耝菆著蓫蕏藸蟵蠩觕詘諔諸诎诸豠跦踀踰鉏閦鸀齭齼"};
const unsigned char PY_mb_chuai[]=  {"踹揣啜搋嘬膪欼膗腄"};
const unsigned char PY_mb_chuan[]=  {"传穿船川串喘傳舛椽钏巛氚荈遄舡踳瑏釧汌歂賗玔輲暷僢剶圌堾惴掾猭甎篅膞舩踹镩鶨"};
const unsigned char PY_mb_chuang[]=  {"床创窗闯疮怆創幢闖摐瘡傸愴牀剏刱窓磢仓仺倉刅剙噇囪囱戧朣橦漴漺牎牕窻膧舂葱蔥"};
const unsigned char PY_mb_chui[]=  {"吹垂锤捶炊槌棰陲缍圌椎錘鎚菙倕埀惙搥桘箠腄郵顀鬌魋龡"};
const unsigned char PY_mb_chun[]=  {"春纯唇蠢醇淳椿純莼蝽鹑脣偆賰暙橁蓴犉惷漘杶鶉萶瑃鰆槆媋鶞鯙僢堾旾朐楯櫄沌浱湻滣睶箺肫胊膞芚萅蒓踳輇輴辁醕錞陙"};
const unsigned char PY_mb_chuo[]=  {"戳绰啜辍龊踔磭綽歠娖輟惙逴齪嚽擉促吷娕婥婼孎拺斫涰淖焯箹簇綴繛缀腏荃蔟趠趵跿踱躇辵辶酫醛鋜錣鏃鑡镞齱"};
const unsigned char PY_mb_ci[]=  {"次此词刺辞赐磁瓷慈茨雌祠兹疵差詞糍佽鹚賜栨辭伺泚偨佌茈嬨絘庛朿跐蛓柌莿濨趀飺餈皉鶿茦呲刾厕厠司呰啙垐堲姕嵯嵳廁措枱柴栜滋澬玼珁甆礠粢縒胔茲荠萕薋薺蚝螅螆蠀赼趑辝辤鈶骴髊鮆鴜鷀齹"};
const unsigned char PY_mb_cong[]=  {"从葱聪丛從琮璁匆骢淙熜婃囱聰従枞苁蔥囪悰聡叢怱悤賨驄孮慒謥暰欉鏦藂蟌樅瑽瞛徖偬忩憁棇楤樬樷漎漗潀潈潨灇焧燪爜碂窗篵総緫縦縱總繱纵聦茐菆蓯誴賩騘"};
const unsigned char PY_mb_cou[]=  {"凑腠湊辏玼楱輳奏揍族簇蔟薮藪趋趣趨"};
const unsigned char PY_mb_cu[]=  {"粗促醋簇蹙蹴猝徂蔟殂卒瘯憱酢麁顣麤觕踧踀鼀且卆噈娕娖媨怚戚捽瘄皻縐縬绉脨蔍蔖誎趋趗趣趥趨踓踤蹵錯错麄麆"};
const unsigned char PY_mb_cuan[]=  {"窜蹿攒篡爨汆撺竄攢镩巑攅攛躥簒僔昕櫕欑殩濽灒熶穳窾篹菆襸鋑鑹"};
const unsigned char PY_mb_cui[]=  {"催崔翠脆摧粹萃淬啐璀瘁悴毳衰榱漼墔膵凗焠膬磪忰翆鏙竁慛隹乼伜体倅啛察崒崪嶉椊槯濢熣獕琗疩皠粋紣綷縗繀缞脃脺臎襊趡踤顇"};
const unsigned char PY_mb_cun[]=  {"村存寸吋忖皴邨蹲籿刌侟墫拵洊浚澊竴踆"};
const unsigned char PY_mb_cuo[]=  {"错撮搓措挫厝錯锉磋矬痤鹾蹉夎嵯棤剉脞瘥齹剒瑳醝鹺莝銼蒫蓌遳嵳髊庴摧昔最澨營睉縒莡蔖虘襊諎躜躦逪酂酇"};
const unsigned char PY_mb_d[]=    {"的大地杜董段戴邓丁窦狄翟刁电党定等当队点代道"};
const unsigned char PY_mb_da[]=  {"打大达答搭哒嗒妲怛達沓鞑耷笪瘩噠龘褡靼咑炟躂鐽薘燵羍繨匒韃鎝畣疸亣剳呾垯塌塔墶憚搨撘橽毼汏溚畗眔矺笚胆荅荙蟽觰詚跶迏迖迭逹鎉龖"};
const unsigned char PY_mb_dai[]=  {"带待代呆戴袋贷黛逮岱大甙歹帶怠殆傣埭玳迨绐呔汏帯貸瀻軑襶柋紿獃靆艜軩骀侢叇嘚垈帒廗懛曃棣毒瑇箉簤緿蔕蚮蝳螮詒诒跢蹛軚轪逯遞遰隶霴馱駄駘驮鮘鴏黱"};
const unsigned char PY_mb_dan[]=  {"但单蛋丹淡胆担弹氮旦诞啖耽卩掸澹儋單惮殚亶勯箪聃膽窞眈噉擔帎赕石郸紞疸殫誕啗泹啿憚憺簞褝亻瘅萏柦襌酖蜑玬譂觛匰禫燀狚嚪砃甔聸癚贉鄲澸刐髧沊鴠黕霮衴丼伔倓僤儃冄冉単呾唌嘾噡坛壇妉娊媅弾彈忱怛惔愖憾抌撢撣檐欿湛潭澶瓭疍癉皽繵耼腅膻蜒蟺襜覘觇訑詹贍赡蹛躭醈頕餤饏馾駳黮黵"};
const unsigned char PY_mb_dang[]=  {"当党档挡荡當裆铛宕檔凼黨砀谠噹擋儅蕩菪璫簹讜盪鐺襠璗礑蟷澢碭艡瓽偒圵场垱場壋婸崵嵣愓攩欓氹潒灙烫燙珰瑒瘍瞊筜簜蘯譡趤逿闣雼"};
const unsigned char PY_mb_dao[]=  {"到道倒刀岛导盗稻捣悼屶槝叨蹈刂祷島纛忉瓙氘菿導嶋盜檤稲儔魛椡捯焘禱裯搗翿嶌帱舠禂擣壔嶹幬釖隝陦隯俦受啁嘄噵宲忑惆朷檮洮涛濤燾箌絩翢薵虭衜衟軇醻陶鱽鳥鸟"};
const unsigned char PY_mb_de[]=  {"的得地德锝底徳悳淂嘚恴惪棏登鍀陟"};
const unsigned char PY_mb_dei[]=  {"得哋"};
const unsigned char PY_mb_den[]=  {"扽扥"};
const unsigned char PY_mb_deng[]=  {"等灯登邓瞪蹬凳噔澄镫燈磴鄧鐙嶝戥簦豋墱嬁璒僜憕橙櫈竳艠覴隥"};
const unsigned char PY_mb_di[]=  {"地第低滴底睇帝的迪弟敌抵递蒂狄堤笛谛娣嘀荻涤邸旳骶棣嫡缔氐菂砥镝觌翟诋碲柢籴敵俤聜墬鞮袛坻磾諦奀滌遞提厎羝禘牴玓蚳締墑苖螮踶糴彽菧嚁蔕阺呧廸隄釱蔋鏑馰藡鸐逓梑髢眱軧靮蹢焍弤甋梊绨仾偙僀儥勺唙啇啲啻坔坘埅埊埞墆奃媂嵽嶳弔弚怟慸扚拞掋揥摕杓杕枤楴樀浟渧珶疐碮祶篴約约肑胝腣芍苐莜蓧蔐藋蝃覿觝詆諟豴赿趆踧蹄蹏逐逮適遰鉪鍉隶頔題题鬄魡鯳"};
const unsigned char PY_mb_dia[]=  {"嗲"};
const unsigned char PY_mb_dian[]=  {"点店电殿垫典颠掂碘滇甸點癫丶踮靛淀巅奠佃癜簟钿惦玷電敁槙坫顛厧傎磹墊癲瘨扂巔蒧壂巓婰蹎阽椣澱蕇驔齻婝佔唸埝奌嵮拈攧敟槇橂橝沾涎湺琔痶腍蜓蜔詀鈿頕顚"};
const unsigned char PY_mb_diao[]=  {"掉吊调叼钓雕屌刁凋貂弔鲷碉鸟铞釣弴伄魡蛁鯛铫琱彫蓧鵰虭殦雿簓奝窵佻倜刀刟嬥扚挑椆汈淍瘹瞗矵稠窎竨粜糶絩綢绸莜藋蜩訋誂調赵趙跳踔軺轺鈟銱鋽錭鑃颩骠鮉鳥鳭鵃鸼鼦"};
const unsigned char PY_mb_die[]=  {"跌碟爹蝶叠迭谍牒褋喋耋堞鲽垤疊蹀諜瓞疂昳詄咥峌絰艓胅嵽蜨畳疉眣镻苵跮佚踮揲哋啑崼幉怢恎惵戜挃挕曡柣楪槢殜氎泆涉渉渫牃眰窒绖耊至臷螲褶褺趃跕踢蹛軼轶鐡鐵鞢鮙鰈鰨鳎"};
const unsigned char PY_mb_ding[]=  {"定顶丁订盯鼎钉锭叮町腚頂啶碇酊玎仃釘訂疔耵萣掟錠帄嵿顁椗虰聢飣靪薡碠甼铤奠奵忊汀濎灯矴磸艼葶鋌鐤饤鼑"};
const unsigned char PY_mb_diu[]=  {"丢丟铥颩銩"};
const unsigned char PY_mb_dong[]=  {"动懂东洞董冬栋冻咚氡東動侗夂峒硐恫胴棟垌鸫凍岽戙胨崠姛蝀働諌涷苳挏嬞迵蕫鮗揰菄埬鼕鶇霘駧鶫倲勭墥娻峝崬昸桐氭湩烔燑狫甬笗筒筩箽絧腖衕詷酮騆鯟"};
const unsigned char PY_mb_dou[]=  {"都斗豆逗抖兜窦陡痘蔸脰鬥钭枓篼闘蚪竇鈄荳鬪读郖唗酘浢餖梪瞗乧侸兠凟剅吺投斣橷毭氀渎瀆窬艔讀逾酡鋀閗阧饾鬦鬬鬭"};
const unsigned char PY_mb_du[]=  {"读度都毒杜独赌堵渡肚督嘟镀睹笃妒犊渎讀蠹獨顿殰牍賭牘篤椟芏涜黩読鍍秺髑瀆覩妬犢帾蝳櫝讟詫蠧贕韥皾韣裻黷醏韇錖儥凟剢剫匵厾噣土塗嬻宅斁晵暏樚樞橐殬琽瓄睪竇竺笁纛荰螙襡襩诧豄鍺鑟锗闍阇陼靯頓騳"};
const unsigned char PY_mb_duan[]=  {"段短断端锻缎椴煅斷鍛緞偳簖葮毈腶籪媏躖碫剬塅彖瑖篅耑褍踹鍴"};
const unsigned char PY_mb_dui[]=  {"对队堆對兑碓隊対敦怼兌镦憝搥懟濧薱譈瀩鴭痽祋頧兊垖埻塠夺奪嵟憞杸濻瀢磓綐膭謉譵追鈗銳鋭錞鎚鐓鐜锐陮"};
const unsigned char PY_mb_dun[]=  {"吨顿盾炖蹲敦墩钝遁盹趸囤沌惇頓鐓礅伅噸燉砘潡楯不鈍遯躉镦撉壿驐俊墪庉忳憞撴橔犜獤碷腞腯蜳豚踲蹾逇鐜"};
const unsigned char PY_mb_duo[]=  {"多躲夺朵堕剁哆铎跺踱舵垛剟惰掇哚敓埵咄柁奪墮朶驮躱沲裰度墯跢鐸錞杕柮陊剫敪嚲痑奲趓嶞毲鈬綞椯鮵鬌鵽缍亸仛兊兌兑凙刴吋喥嚉垜夛媠嫷尮崜憜挅挆捶揣敚敠杂枤柂桗棰橢沰沱澤痥硾茤袳詑誃貀跥跿軃郸鄲鍺锗陀陏隋隓飿饳馱駄點"};
const unsigned char PY_mb_e[]=  {"额俄饿呃恶哦厄诶鹅鄂娥莪蛾扼峨噩鳄屙丨萼颚讹峩遏愕腭锷谔鍔枙惡皒轭涐婀餓垩阿額鹗欸锇噁鵝砵苊訛顎囮搹迗娾珴悪阨崿鱷睋諤譌鵞頞咢堮軛遻砐堊廅峉蝁鑩鰐鶚軶歞匎餩齶蚅蕚砨櫮鵈豟阏亚亜亞伪佮侉偔偽僞僫匼卾吪呝咹哑唖啈啊啐啞囐垭埡堨妸妿姶娿媕屵岋庵戹搕搤擜曷椏歹歺洝湂玀琧痷砈硆硪磀礘胺蒍蘁覨詻誐讍輵遌邑鈋鋨閜閼阸隘頟騀鬲魤魥鰪鴳齃齾"};
const unsigned char PY_mb_ei[]=  {"诶欸"};
const unsigned char PY_mb_en[]=  {"恩嗯唔摁蒽奀峎煾饐"};
const unsigned char PY_mb_er[]=  {"而二儿尔耳贰饵迩弍兒洱珥铒爾鸸洏栭貳侕餌鲕佴鉺邇弐毦陑咡貮粫荋刵薾胹栮輀峏鴯駬鮞轜衈児唲嬭尒尓杒樲渪濡耏聏臑袻誀趰輭陾隭髵髶"};
const unsigned char PY_mb_f[]=    {"分发范樊方冯反放复风防非封富翻"};
const unsigned char PY_mb_fa[]=  {"发法伐罚阀乏發筏珐髮垡発罰髪砝閥琺沷醗瞂罸疺藅佱傠姂廢彂拔拨撥栰橃汎泛灋笩茷蕟貶贬醱鍅"};
const unsigned char PY_mb_fan[]=  {"饭反烦翻凡范返犯番泛繁樊帆贩梵藩钒蕃幡攵矾勫飯畈犭煩璠蘩燔範墦辺販仮柉汎氾蹯繙旛薠瀿籵笵轓軓礬膰奿釩杋飜鐇瀪払軬蠜笲羳嬏舩旙颿橎滼鱕鷭伋凢凣匥噃婏嬎嬔忛憣拚棥楓渢犿畨盕籓緐舤舧蟠袢襎訉飰"};
const unsigned char PY_mb_fang[]=  {"放方房防芳坊仿访纺舫妨枋昉肪鲂彷倣訪钫紡邡鈁昞魴瓬淓錺髣鶭匚埅堏旊昘汸牥眆眪祊蚄趽雱鰟鳑鴋"};
const unsigned char PY_mb_fei[]=  {"非飞费肥菲废肺妃匪斐绯沸翡霏吠扉啡飛鐨腓诽費痱俷淝蜚芾狒镄篚廢悱榧棐緋櫠馡怫癈剕婓鲱誹屝暃厞騑廃蜰裶騛奜蟦襏曊鯡餥濷昲疿胇鼣墢婔拂朏杮柹橃橨渄犻猆琲砩祓笰紼绋胏胐茀茇萉蕜蕟蕡裴裵陫靅靟飝髴鼥"};
const unsigned char PY_mb_fen[]=  {"分份粉芬粪坟奋酚愤纷焚汾忿氛鼢瀵吩濆鲼偾玢墳蚡棻棼紛昐糞憤蒶奮枌僨蕡妢雰鈖坋羵黺翂豶轒弅魵膹幩梤橨鳻羒鼖饙炃黂竕鐼秎匪喷噴坆奔岎帉愍扮拚敃朆朌歕燌燓燔獖盼瞓砏肦葐蚠衯訜豮賁贲躮錀隫頒颁餴馚馩鱝"};
const unsigned char PY_mb_feng[]=  {"风封峰疯冯凤丰锋枫逢缝奉蜂烽沣讽風俸砜鳳葑瘋賵酆楓豐鋒馮偑崶峯縫諷灃唪檒渢犎覂堸妦桻猦麷凬捀焨甮艂飌仹僼凨凮埄夆寷捧摓沨泛浲湗溄漨炐煈熢琒盽碸篈綘肨舽莑蘕蘴蚌豊赗逄鄷鎽鏠靊鳯鴌鵬鹏"};
const unsigned char PY_mb_fo[]=  {"佛仏坲仸梻"};
const unsigned char PY_mb_fou[]=  {"否缶紑缹鴀不垺妚炰缻芣衃雬"};
const unsigned char PY_mb_fu[]=  {"副付服福富负夫复赴府父附符傅扶浮幅腹伏敷赋弗甫妇覆辅抚腐拂氟芙肤斧阜俯缚孚馥佛釜孵腑辐俘蝠凫苻涪祓脯麸復呋頫讣褔冨黻滏芣罘咐鍑赙拊輔黼洑賦匐绂绋負蝮茀驸鲋跗鵩桴茯撫趺袱婦幞諨綍伕鄜膚稃複郛縛砩菔偩姇艴帗祔芾簠枹駙蚨蜉鈇冹偪怫袚紱輻紨彿箙鳆枎蝜莩柎泭衭垘榑咈緮荂刜虙砆麩坿訃琈綒蚹輹岪鮒椨萯柭鳧葍怤笰萉罦紼釡賻蚥澓蕧烰髴弣鰒蜅郙踾荴玸韍鶝柫鳬邞艀嬔蛗畉糐翇鴔不乀仅俌俛包呒哹哺嘸垺報妋娐婏媍嬎宓尃峊巿彳怀懯抙捊捬掊旉栿棴椱汱沕沸溥炥焤玞璷甶畐畗癁盙禣秿稪竎筟箁粰絥纀胕莆蓲袝襆襥覄詂豧費费軵还邚郍酜酻鉘鉜錇鍢锫阝陚鞴韛韨颫颰鬴鮄鮲鳺麬麱"};
const unsigned char PY_mb_g[]=   {"个国工过高郭戈葛耿巩龚甘干古贾谷顾关管各革公根更改光广果格共搞"};
const unsigned char PY_mb_ga[]=  {"噶嘎咖伽尬尕轧旮钆夹尜胳呷嘠玍軋釓錷魀"};
const unsigned char PY_mb_gai[]=  {"该改盖钙概丐乢該蓋溉赅垓陔芥鈣祴荄葢戤瓂槪賅豥漑峐賌侅匃匄咳姟忋摡晐杚核槩汽畡磑絠絯胲郂鎅閡阂阣隑骸"};
const unsigned char PY_mb_gan[]=  {"干甘感敢赶肝杆赣竿苷乾柑咁秆淦擀幹绀橄酐矸趕疳尴坩皯泔詌桿旰玕澉紺簳贛稈笴凎筸骭玵尷盰灨漧个乹亁仠佄倝凲奸尲尶忓扞捍攼榦檊汗汵浛篢粓芉虷衦諴豃贑迀釬錎飦魐鰔鱤鳡鳱"};
const unsigned char PY_mb_gang[]=  {"刚港钢岗缸纲冈杠肛罡戆剛崗岡鋼扛綱槓釭棡筻堽犅堈疘亢伉冮戅戇抗掆溝焵牨犺矼碙罁罓肮鎠阬頏颃"};
const unsigned char PY_mb_gao[]=  {"高搞告稿膏糕皋镐锆郜羔篙诰杲睾缟槁藁睪髙檺槔誥皐槹縞櫜韟祰鼛鋯勂筶鷎吿咎夰峼暠槀橰浩滜澔獋獔祮禞稁稾羙臯菒蒿藳鎬餻鷱"};
const unsigned char PY_mb_ge[]=  {"个各格歌哥隔割阁葛戈咯搁革個铬鸽镉舸嗝膈戓硌疙圪胳閣鬲彁骼纥颌箇滆謌哿搿擱盖佮虼閤袼蛤獦鉻仡鴿轕塥滒鎘觡合韐吤愅鮯杚鞷鴐騔屹介佫匌可呄嘅嘢噶戨扢挌敋槅櫊浩澔牫牱犵猲砝秴紇肐臈臵茖菏蓋蛒裓詥諽輵鉀鉿鎑鎶钾铪閘闸鞈韚頜髂魺鮥鰪鲄鴚鵅"};
const unsigned char PY_mb_gei[]=  {"给給"};
const unsigned char PY_mb_gen[]=  {"跟根艮哏亘茛揯搄痕"};
const unsigned char PY_mb_geng[]=  {"更庚耿耕梗羹哽埂鲠赓绠颈綆亙畊浭挭緪賡鯁堩郠峺骾菮鶊亢刯恆掶暅椩焿硬絙絚縆羮莄邢郉頸鹒"};
const unsigned char PY_mb_gong[]=  {"共工公供宫功攻弓龚拱恭贡巩汞躬宮肱觥珙蚣貢栱幊塨鞏红龔拲輁匑熕匔厷咣唝嗊廾愩慐杛杠渱碽篢糼紅羾虹蛩觵贑贛赣躳銾髸魟龏"};
const unsigned char PY_mb_gou[]=  {"够狗购沟勾钩构苟垢夠媾诟篝枸觏彀岣缑遘姤溝鉤佝笱緱鞲購芶袧鈎構簼冓搆耇雊覯韝耉玽句傋区區呴坸抅拘撀泃煹耈茩蚼褠訽詬豰豿軥鮈鴝鸜鸲"};
const unsigned char PY_mb_gu[]=  {"股故古顾谷骨鼓孤固姑估雇沽菇蛊箍辜钴呱咕瞽毂崮菰臌牯鹄顧罛痼诂锢觚蛄汩轱榖穀酤罟箛棝鹘鲴鸪蠱梏贾稒鈷嘏僱牿羖詁盬堌愲榾柧轂泒凅皷峠軱尳嫴啒蓇鴣錮瀔蛌硲鮕唃薣濲橭逧傦劷告哌唂嗀嗗夃崓怘扢抇枯櫎淈滑焸瓠皋磆祻笟篐糓縎胍脵臯苦苽角賈軲鈲頋餶馉骰鯝鵠鶻鼔"};
const unsigned char PY_mb_gua[]=  {"挂瓜刮卦寡呱剐褂胍栝掛诖鸹罣剮苽劀緺騧括詿颪鴰颳冎叧咶咼啩坬惴歄焻煱絓罫舌諣趏踻銛銽铦"};
const unsigned char PY_mb_guai[]=  {"乖怪拐夬恠掴柺枴罫叏哙噲箉"};
const unsigned char PY_mb_guan[]=  {"管关官观馆灌冠罐惯贯棺莞倌關祼觀掼館鹳琯瓘纶鳏鏆涫盥観矜慣貫瘝摜閞悹錧鑵舘筦蒄悺毌爟鸛樌鱹鱞痯丱串卝婠懽斡果桄櫬權沦泴淉淪潅癏矔礶窤綸罆菅萖覌躀輨遦関闗雚鰥鳤鵍"};
const unsigned char PY_mb_guang[]=  {"光广逛咣廣桄胱犷洸広侊垙俇撗珖銧茪欟炚烡僙姯恍扩挄擴横櫎潢灮炗炛獷硄臦臩趪輄迋黆"};
const unsigned char PY_mb_gui[]=  {"贵鬼归桂规龟柜硅跪轨圭闺癸诡瑰珪妫貴櫃桧佹歸鲑刿簋炅皈匦晷規龜垝姽庋槻湀槼宄劌亀鳜刽邽瞡軌詭袿帰媯摫庪閨匭劊槶厬撌氿蟡觤椢鳺禬蛫祪筀茥猤傀炔伪偽僞匮匱哇娃嫢嬀嶡嶲巂廆恑攰攱昋朹桅椝概槣檜櫰櫷沩洼溎潙璝瓌癐瞆瞶硊祈窐簂絵繪绘胿膭蓕蘬螝襘觖謉赽趹蹶郌陒隗雟鞼騩鬶鬹鮭鱖鱥鴂鴃"};
const unsigned char PY_mb_gun[]=  {"滚棍辊衮鲧丨滾绲棞磙惃輥袞鯀璭蔉浑混渾琯睔睴緄緷蓘裷謴錕锟鮌鰥鳏"};
const unsigned char PY_mb_guo[]=  {"过国果郭锅裹過掴國囗虢椁鍋蝈帼呙粿聒聝涡淉埚幗菓馘惈崞蜾彉鐹猓摑瘑墎槨圀嘓褁慖蔮漍簂划咶咼唬啯囯囶囻埻堝彍搓敋枸楇櫎活渦濄矌綶腂腘膕蜮蝸蟈蠃輠鈛錁锞餜馃"};
const unsigned char PY_mb_h[]=   {"和会后何黄胡洪侯贺霍扈韩华郝化好合还活很回号毫花或海话红火害"};
const unsigned char PY_mb_ha[]=  {"哈蛤虾铪吓呵奤妎為獬蝦鉿"};
const unsigned char PY_mb_hai[]=  {"还海害嗨咳孩還亥骇嘿氦骸醢嗐駭侅胲烸絯塰駴餀咍咴嚡拸欬猲郂酼閡阂頦颏饚"};
const unsigned char PY_mb_han[]=  {"汗喊含寒韩汉涵函焊翰旱憨瀚罕撼悍憾晗酣菡捍琀邯漢焓韓鼾颔邗蚶顸扞犴晥榦撖阚螒頇唅豃閈暵釬虷凾谽蔊哻魽鋎頷銲鋡涆駻蜬睅顄鶾嵅甝鬫梒蜭雗莟仠佄傼兯厂厈咁嚂圅垾娢嫨屽崡嵌忓感攼旰晘桿椷欦歛汵泔浛浫淊淦滩澉澏澣灘熯爳猂甘皔矸笒筨糮肣蘫蛿譀軒轩鈐钤闞闬靬頜顩馠馯鳱"};
const unsigned char PY_mb_hang[]=  {"行航杭夯吭巷绗沆垳斻颃迒苀貥笐魧蚢絎頏珩妔忼桁炕狼筕肮邟酐"};
const unsigned char PY_mb_hao[]=  {"好号浩豪耗郝昊皓毫灏嚎蒿濠蚝號壕颢镐嗥薅貉鎬嚆滈淏灝皜皞澔顥蠔晧暠哠鄗譹籇薃昦竓鰝傐儫呺唬嘷噑妞恏悎暤暭曍椃滜獆獋皋皡皥睾秏翯聕膠臯茠薧藃虠諕鎒鐞"};
const unsigned char PY_mb_he[]=  {"和喝何合河呵核盒贺荷鹤赫禾褐诃壑颌阖涸爀嗬阂菏犵翮劾曷貉訶楁賀盍鶴鞨啝郃纥敆吓姀蚵佫粭挌闔翯鉌盉熆熇澕龢覈渮煂寉紇鶡閡魺靍齕峆篕靏籺齃餲鑉麧呙呼咊咼哈哬喛嗃嗑噈嚇垎害惒愒抲揭柇格欱毼洽渇渴湼焃燺狢癋皬盇硅碋礉秴繳缴苛萂藃藿蝎螛蠚袔訸詥謞貈輅轄辂辖阋隺霍靎頜餄饸鬩鲄鵠鶮鸖鹄鹖龁"};
const unsigned char PY_mb_hei[]=  {"黑嘿嗨黒潶嬒"};
const unsigned char PY_mb_hen[]=  {"很恨狠痕鞎拫佷哏噷掀艮詪"};
const unsigned char PY_mb_heng[]=  {"横哼恒衡亨珩蘅佷桁橫姮恆脝烆啈鑅胻鵆堼悙涥狟訇鴴鸻"};
const unsigned char PY_mb_hong[]=  {"红宏洪哄鸿虹弘轰泓烘紅薨闳吽紘荭苰訇竑鴻鍧黉仜轟垬蕻魟愩鋐翃葒讧鉷浤澒澋汯灴渱訌玒嗊谹谼吰彋竤鈜軣嚝閎妅霟霐鞃輷耾黌羾焢宖篊厷叿哅唝娂屸巆揈撔晎汪浲港渹潂玜瓨硔硡粠紭綋纮翝舼葓謍谾銾閧闀闂鬨"};
const unsigned char PY_mb_hou[]=  {"后厚後侯吼候猴喉鲎骺篌逅堠垕瘊齁洉糇詬葔腄郈帿鍭翭茩鯸鄇鱟餱吽呴犼睺矦翵诟豞銗鮜鲘"};
const unsigned char PY_mb_hu[]=  {"胡户湖虎呼沪乎互护忽糊壶狐弧唬寣弖扈斛鍙祜琥许浒笏瑚戏蝴葫瓠滹鹄和惚怙槲煳護戸戽壺戶唿觳綔乕鹘囫鹕嫭俿烀滬嫮猢枑縠醐岵鹱鄠冴粐核虖冱轷鵠滸淴鰗淈縎箎沍熩垀鬍楜抇瀫槴淲雽匢鯱曶媩歑螜昒昈鶻焀頀餬壷韄嘝鶦蔰婟鶘衚魱匫喖嗀嗃嘑嚛姱帍幠怘恗戯戱戲搰摢擭楛殻汩汻泘洿濩瓡瓳礐穫箶簄絗縏羽胍膴舗芐芔芦芴苦苸萀蔛虍虝觷許謼豰軤鈷鋘錿鍸钴隺雇雐頶鱯鳠鳸鴩鶮鸌"};
const unsigned char PY_mb_hua[]=  {"话花化画华划滑桦哗骅話畫華嬅铧樺猾畵錵埖劃糀椛槬砉嘩螖嫿搳崋譁杹吪繣驊摦諙魤澅硴鷨鏵蘤侉劐哇姡婲婳学學找撶敌檴浍澮獪璍磆稞粿腂舙芲蒍蕐蘳觟誮諣譮豁輠釪釫鋘鮭鲑黊"};
const unsigned char PY_mb_huai[]=  {"坏怀淮槐踝徊壞懷壊懐划褢蘾櫰褱蘹佪咶喟嘳圳坯瀤耲"};
const unsigned char PY_mb_huan[]=  {"换还环患欢幻缓唤焕桓浣寰宦換涣奂鬟獾洹嬛豢痪歡郇環缳擐圜喚驩鲩煥逭緩漶萑锾讙轘歓澣懽雚貆睆潅渙澴奐瘓峘豩荁犿鍰鴅繯豲嚾瑍闤攌羦肒鯇瞣雈鰀喛圂垸堚孉寏嵈巜愌懁援梙槵欥汍灌烉狟瑗瓛皖眩睔瞏糫絙綄脘萈蒝藧螌蠸貛輐還酄鉮鐶镮阛鯶鵍鸛鹮鹳"};
const unsigned char PY_mb_huang[]=  {"黄晃皇慌荒煌谎凰恍簧磺璜黃惶蝗篁幌徨湟肓潢鍠愰隍遑偟怳崲滉癀皝喤晄謊汻蟥鳇巟媓穔獚兤熿艎諻榥衁鐄鰉炾堭趪楻餭鎤葟奛騜鷬塃墴宺揘曂朚櫎洸熀爌瑝皩縨芒茫詤锽韹鱑"};
const unsigned char PY_mb_hui[]=  {"会回灰辉汇惠慧毁挥會晖绘徽悔蕙卉秽晦讳恢烩诲囘荟喙贿茴彗拻恚珲洄麾桧輝隳蛔恵咴繪虺絵毀溃迴匯揮诙廻蟪佪諱徊缋穢暉誨彙恛撝薈槥鐬徻洃檜襘燴詼賄嘒輠翬燬顪篲硊毇譓橞螝圚潓薉烠噅蔧闠獩譿豗禈痐憓芔蘳暳譭檓楎瞺鰴繢翽隓餯藱檅哕浍僡儶叀噕噦嚖囬堕墮壞婎媈孈寭屷幑廆廽彚懳椲櫘沬泋涣湏滙澮濊瀈灳烜烣煇煒琿璤璯瘣皓眭睢睳翙翚蒐蘬虫蚘蛕蜖袆褘詯譮违逥違銊鏸阓靧鞼韋韢韦頮鮰鼿齀"};
const unsigned char PY_mb_hun[]=  {"混昏魂婚荤浑溷馄棔阍閽诨掍惛珲倱渾圂諢琿涽慁緄觨睯繉餛睧鼲俒婫忶惽挥捆揮昆昬梡梱棍殙湣湷焄焝眃緍緡绲缗葷蔒轋顐餫"};
const unsigned char PY_mb_huo[]=  {"或活货火获霍祸惑伙豁和灬镬嚯佸獲鈥貨嚄禍藿钬豰夥耠蠖捇漷吙鑊攉劐湱锪濩秮臛姡咊膕謋曤嗀矐騞癨穫沎檴趏眓瀖俰剨化咟嚿奯扮掝搉擭旤楇濊焃瓠矆礊秳篧耯腘艧萿蒦諕越過邩鍃閄隻雘靃魊"};
const unsigned char PY_mb_j[]=   {"级贾江蒋姜焦金靳晋就进加经家结阶间件及解较机军接教极九见"};
const unsigned char PY_mb_ji[]=  {"及级即几机既急集记极鸡寄基继吉计挤季剂暨纪己积籍技击姬济肌忌祭疾激迹辑际冀叽寂妓脊饥霁戟骥藉绩汲棘旡髻矶彑蓟亼畸伎箕丌唧讥畿稽系丮偈羁記機嫉極稷缉嵇幾鲫亟計悸玑屐級赍銈觊殛期笈紀其咭麂嵴奇戢楫剤跻雞繼佶圾给鐖骑笄瘠劑剞喞擠芨洎勣漈積撃績芰輯櫅乩擊掎犱齑濟革伋虮岌罽荠吇墼姞鶏蕺跡岋忣際偮茍蠀彶潗緝茤磯鲚诘譏跽卽嘰犄饑継蒺妀誋旣暩湒惎繋羈薊薺飢漃泲驥諅徛穄鷄蕀虀覿枅塈鶺霽諔羇璣皀叝躋蹟覊鞿齎蹐觙鮆撠覬揤覘臮簊膌踖鸄堲簎隮蘻嶯齌谻禝裚鱭瀱鰶齏槉穊鏶懻痵庴轚檕蘮錤銡癠霵刉癪畟耭鑇襋鱀韲鰿螏穖橶鵋鷑塉鯚哜乁倚僟兾刏卙卟厝呰嗘嚌坖垍墍姼尐居屰峜嵆帺廭彐愱憿懠揖撽攲敧曁梞棋楖槣樭檝檵櫭毄汥洁淁済濈焏狤猗璂璾疵瘵皍睽瞉瞿禨秸稘稩穧筓箿粢糭紒結給縘繫结耤胔脔脨艥艻芶苙莋萁萕葪蒩蔇蕲蘄蘎蜡蝍蟣蟻蟿褀襀覉觇觌觭訐譤讦谿賫賷趌趞跂踑踦躤躸郅郆鄿鍓鑙隔雦雧鞊颳騎鬾魝魢魥鯯鯽鱾鳮鹡齊齍齐"};
const unsigned char PY_mb_jia[]=  {"家加假价架甲佳夹嘉嫁贾驾钾迦茄颊稼痂珈葭荚枷伽戛镓岬戞笳鎵傢铗郏夾價瘕駕賈浃胛袈恝榎幏跏蛱嘏斝頰豭筴泇鉀莢耞糘頬貑鋏犌婽郟毠椵抸猳梜扴鵊檟玾蛺鴶麚佼挟皎侥挢徼湫敫袷叚呷咖唊圿埉夏夓宊徦忦押拁拮挈挾揩揳擖斚暇榢槚浹猰脥腵蝦裌跲鉫鉿铪頡颉餄饸駱骆骱"};
const unsigned char PY_mb_jian[]=  {"见间建件剑键兼减贱健捡剪简箭检肩尖渐坚煎监舰拣奸碱鉴溅荐涧歼茧俭谏践笺見柬艰牋睑戋翦蹇間腱僭劍菅缄熸槛簡硷饯幵锏鑳賤繝犍囝戬谫蒹湔剣鍵漸姦枧堅缣撿鞯裥踺減鑑謇笕搛儉牮殱偂檢瞼艦濺毽趼殲倹楗洊鹣薦俴鑒剱劒挸検揀彅瑊澗賎監箋鲣浅墹踐湕繭艱鹼樫磵惤劗鞬戔戩緘鋻瞷劔縑瀸籛諓餞礛譾熞珔菺襉椷櫼蕑鰹藆襺螹瑐鵳鹸糋釼虃鬋韉鰎轞猏寋擶葌麉侟傔僣冿前劎喊囏堑堿塹姧孱帴弿徤揃揵攕旔暕朁柙栫梘椾榗橌橏橺檻涀淺滥濫瀐瀳瀽玪睷瞯碊礀礆稴筧箴篯籈絸纎纖纤聻臶茛葏葥蔪蕳蠒袸襇覵覸詃諫謭譖譼谮豜豣趝跈醎醶釰鈃銒銭鋄鋑錢錬錽鍊鍳鎫鏩鐗鐧鐱鑬鑯钘钱閒险險靬韀餰馢騫骞鰔鰜鳒鳽鶼鹹鹻黚黬"};
const unsigned char PY_mb_jiang[]=  {"将讲江奖降姜蒋酱浆將僵疆匠绛桨講犟獎缰丬蔣洚殭耩豇弶茳醬礓薑絳傋漿糨槳畺櫤奨虹强奬謽醤橿膙螿韁顜袶嵹杢翞勥匞塂壃夅弜強彊摪摾滰畕疅糡紅繮红葁蔃螀鱂鳉"};
const unsigned char PY_mb_jiao[]=  {"叫交教较脚角胶焦娇觉浇搅缴嚼矫绞椒郊轿骄窖礁蕉姣蛟饺皎铰剿跤狡校滘較酵鲛腳侥鐎醮徼佼攪敎茭悎繳湫笅儌鹪挢噍峤敫膠憍嬌僬撹艽澆驕灚筊絞皦僥獥矯劋斠勦嘂簥挍轎爝膲珓憿摷鵁皭撟鉸鮫餃曒樔蟭煍釂譥嶕敿鷮穚嬓趭嘄纐鷦鵤鱎乔侨僑勪却卻呌咬喬嘐嘦噭妖嫶孂学學峧嵺嶠嶣恔憢捁敥敽晈暞橋櫵湬漖潐激灂烄焳燋璬稾窌糾纠臫芁茮菽萩蕎藠虠蟜覐覚覺訆譑賋趫踋蹻轇鄗釥骹"};
const unsigned char PY_mb_jie[]=  {"接借解节姐街界结杰皆届戒洁介截捷揭劫阶婕嗟藉湝竭尐孑喈桀诫芥睫颉羯诘卩桔結蚧讦傑節秸劼玠疖偈疥碣紒屆拮堺唶潔階崨家掲曁誡骱岕倢檞詰鲒訐滐褯耤楬岊狤癤妎袺楷蝍衱阂痎犗迼砎刧楶趌桝价頡昅跲嵥幯鉣蛶鞊踕蝔畍鞂鍻蠽巀榤鶛媎丯亥假偼價刦刼卪吤唧啑嚌圾堦契她媘媫嫅嵑嶰嶻庎徣忦悈扢担拾搩擑擮擳斺暨椄楐概構櫭毑洯渇渴煯獬琾疌砝礍祖稭籍紇絜繲纥脻艐莭菨蓵蛣蜐蠘蠞衸袓袷裓觧誱謯鍇锴雃飷髫魝魪鮚"};
const unsigned char PY_mb_jin[]=  {"进金近仅尽紧今劲斤锦禁晋津筋浸谨靳瑾巾噤襟矜進堇槿盡缙衿烬觐瑨緊僅妗荩勁錦晉殣煡謹枃馑卺賮溍寖赆菫廑祲僸儘笒紟侭巹搢嚍璶燼嬧璡蓳觔藎縉覲贐壗珒惍堻饉濜榗伒兓凚劤厪吟唫埐墐婜嫤嬐嶜慬斳歏浕漌濅琎琻砛竻紾肋臸荕菳訡釒釿鋟钅锓馸鹶黅齽"};
const unsigned char PY_mb_jing[]=  {"经静竟精景净京井惊镜敬晶警颈境竞靖径劲茎荆菁婧鲸睛泾旌璟殑經胫兢靜迳粳阱肼腈痉憬驚儆鏡淨刭靓弪競瀞経頸蟼獍亰丼徑凈荊倞弳莖暻鯨浄劤汫橸逕鶄旍鼱穽憼涇痙婛幜獷桱竸麠頚竫璥剄鵛鶁仱俓傹儬勁坓坕坙妌婙宑巠擏晟曔梷檠氏汬濪烃烴燝猄璄秔稉竧箐粇聙脛葝蜻誩踁醒鋞陉陘靑青靘靚頴颕麖"};
const unsigned char PY_mb_jiong[]=  {"囧迥炯窘冂冏煚扃炅熲臦浻泂烱褧坰駉絅臩燛逈昋侰僒冋垧埛宭扄澃瀅煛熒燑綗蘏蘔銄鎣顈颎駫"};
const unsigned char PY_mb_jiu[]=  {"就酒久旧九救揪玖究舅纠鸠灸咎臼鹫韭僦啾厩舊疚赳桕柩阄鳩鬏糾鷲殧勼韮糺萛廄氿慦杦揫柾廐廏鬮朻麔鯦丩乆乣倃剹匓匛匶噍奺愁捄揂摎樛橚汣湫湬牞畂稵穋窌紤繆缪舏蝤镹齨"};
const unsigned char PY_mb_ju[]=  {"据局距句居具巨剧聚举菊俱拒矩锯鞠惧橘桔驹拘炬狙钜掬據焗讵踞遽沮裾劇姖苴椐莒琚疽雎榘咀舉锔倨苣閰屦倶袓榉拠椈飓趄柜鞫洰龃窭秬崌枸醵踽且筥懼鉅粔詎挶俥鋸泃埧岠侷駒挙輂罝车踘虡擧椇匊懅鵙岨蚷犋娵屨湨壉駏犑櫸淗蒟鶪駶澽豦襷涺颶狊痀蜛梮欅耟陱躆鶋焣腒蘜郹驧鋦鵴瞿仇伡佝僪冣凥勮告圧坥埾姐娶婅婮寠巈弆忂怇怐怚愳抅拱捄揈揟昛檋歫毩毱泦渠爠珇眗砠租窶篓簍簴籧粷聥臄艍菹萭葅蒌蒩蓻蔞蘧處蛆螶諊貗趉趜趡足跔跙跼蹫蹻躹軥邭邹郥郰鄒鄹鉏鋤鐻锄雏雛驕骄鬻鮈鮍鮔鲏鴡鼰鼳齟"};
const unsigned char PY_mb_juan[]=  {"卷捐娟倦绢涓鹃眷圈隽劵镌狷鄄蠲捲桊鐫絹锩罥雋羂鵑朘呟睊帣睠鋑淃臇菤裐絭錈勌勬圏埍埢奆姢嶲巂弮悁惓慻擐梋棬泫焆獧瓹甄眩睃縳脧腃萒蔨蕊蕋蜷襈讂踡身鋗鎸闂雟鞙韏飬餋鵍"};
const unsigned char PY_mb_jue[]=  {"觉绝决角掘诀爵珏倔厥撅孓嚼亅廴噘蕨攫崛谲覺蹶絕抉玦傕橛噱矍決镢桷覚獗訣劂脚赽鷢絶憰钁觖駃蕝趉鐍芵爝譎玨鴃虳殌觼玃屩臄刔瘚貜鱖镼彏趹嶡鈌蟨戄嗟乙勪匷叏吷啳埆壆夬妜孒屈屫崫嶥弡憠挗捔撧斍柽橜欔欮氒泬潏灍焆焳熦燋爑爴狂瑴璚疦矞矡砄穱穴繑繘腳蕞蚗蛙蟩蠼袦覐誳蹷蹻躩較较逫鐝闋闕阕阙鞒鞽騤骙髉鳜鴂鶌龣"};
const unsigned char PY_mb_jun[]=  {"均军君俊菌郡钧骏峻筠隽珺竣浚軍捃鈞鍕寯駿龟箟畯麇儁皲埈莙皹晙鮶皸餕焌燇蔨鵘鵔桾袀蚐呁蜠碅勻匀姰懏攈旬汮濬焞狻箘葰覠訇銁銞鋆陖雋馂鲪鵕麏麕龜"};
const unsigned char PY_mb_k[]=   {"可开看蒯克孔邝寇科口空苦快考刻靠况块困宽矿抗卡"};
const unsigned char PY_mb_ka[]=  {"卡喀咖咔佧咯垰胩鉲擖裃呿珈衉"};
const unsigned char PY_mb_kai[]=  {"开凯楷恺開铠揩慨锴剀蒈凱忾垲暟锎欬鍇闓愷鎧剴颽烗輆勓塏鎎劾喝喫嘅噄奒嵦幆愒愾核欯渇渴溘濭炌炏衉豈鐦闿雉"};
const unsigned char PY_mb_kan[]=  {"看砍坎侃刊堪勘阚槛龛瞰磡丬戡嵌竷矙顑莰崁墈檻衎栞轗偘冚凵喊埳堿塪嵁惂扻欿歁監碪莶薟譼輡輱轁闞靬餡馅龕"};
const unsigned char PY_mb_kang[]=  {"抗康扛炕亢糠慷鈧伉钪闶摃囥犺鏮邟漮鱇嫝匟閌坑奋嵻忼杭槺沆砊穅粇荒躿阬骯"};
const unsigned char PY_mb_kao[]=  {"靠考烤拷尻铐栲犒洘攷銬薧稾丂嵪彀挢搞撟槀槁焅熇燺藳訄髛鮳鯌鲓"};
const unsigned char PY_mb_ke[]=  {"可课克科客刻壳颗柯棵渴磕咳珂苛恪嗑坷髁轲颏缂蝌錒窠氪課峇敤岢瞌顆疴稞溘骒钶蚵鈳剋牁锞榼砢匼痾軻悈渇龕頦鉿濭堁搕磆毼騍薖萪趷嵙樖犐嵑緙翗嶱呵勀勊喀娔尅愘愙揢欬歁殻炣盍硞碣碦礊礚窼簻胢艐衉袔醘錁铪锕龛"};
const unsigned char PY_mb_kei[]=  {"尅剋勀刻勊"};
const unsigned char PY_mb_ken[]=  {"肯啃垦恳裉懇龈墾掯錹垠狠珢硍肎肻褃豤貇頎颀齦"};
const unsigned char PY_mb_keng[]=  {"坑吭铿脛鍞鏗阬誙牼銵硻劥坈奟妔忐挳揁摼殸硁硍硎硜胫踁鉺铒"};
const unsigned char PY_mb_kong[]=  {"空孔控恐倥箜崆悾鞚硿錓埪宆椌涳矼穹羫腔躻鵼"};
const unsigned char PY_mb_kou[]=  {"口扣抠寇叩蔻眍筘芤彄冦釦摳瞉滱怐鷇簆佝剾劶妪嫗宼挎敂毆溝眗瞘窛竘茠蔲鏂"};
const unsigned char PY_mb_ku[]=  {"哭库苦酷裤枯窟堀刳绔庫骷褲喾楛矻袴朏搰瘔嚳跍捁桍胐狜俈古圐圣崫扝挎掘泏焅硞秙窋絝趶跨郀鮬齁"};
const unsigned char PY_mb_kua[]=  {"跨夸垮挎胯侉誇姱骻錁銙絓舿咵恗晇楇華蕐袔锞顝髁"};
const unsigned char PY_mb_kuai[]=  {"快块筷侩蒯会脍哙塊浍郐儈狯鱠澮鄶璯膾獪圦廥旝傀凷噲墤巜擓會糩蒉蕢駃鬠魁鲙"};
const unsigned char PY_mb_kuan[]=  {"款宽髋寛寬窾梡髖完棵欵歀窽鑧顆颗"};
const unsigned char PY_mb_kuang[]=  {"狂矿框况匡筐旷圹邝眶诳哐诓曠夼劻贶況纊誑纩狅鵟壙洭礦鄺丱鑛矌爌誆絖穬恇鉱懭軦貺軠絋昿筺砿儣兄匩卝岲廣忹懬抂枉湟眖硄磺軖軭迋逛邼鋛黋"};
const unsigned char PY_mb_kui[]=  {"亏奎葵魁窥盔溃愧馈逵夔揆匮勹喹樻岿戣蒉虧潰蝰馗聩篑傀愦喟媿睽悝櫆匱窺隗暌煃刲跬饋蕢聧騤卼憒聵蹞頍嘳楏躨闚顝餽簣頄鐀嬇欳蘬鍷楑藈鄈頯尯巋巙晆歸殨瞶磈籄缺聭胿腃膭臾蒍蘷虁觖謉踩鍨鑎闋阕頃顷骙"};
const unsigned char PY_mb_kun[]=  {"困坤昆捆琨鲲锟醌褌閫焜崑睏悃髡阃晜綑壼梱鰥鶤臗稛騉菎鯤豤裍錕涃猑硱卵堃堒壸婫尡崐混潉熴瑻祵稇罤蜫裈裩貇閸頑顽餛馄髠髨鳏鵾鹍齦龈"};
const unsigned char PY_mb_kuo[]=  {"扩阔括廓闊擴蛞萿拡濶适懖筈鞹葀霩韕鬠栝会刳哙噋噲挄會桰漷燭爥秳邝鄺鞟頢髺"};
const unsigned char PY_mb_l[]=   {"了来赖罗吕刘鲁李林雷廖卢梁厉廉陆龙黎鹿量理路里论两利领流力立料连老六轮类列"};
const unsigned char PY_mb_la[]=  {"啦拉喇辣蜡腊剌落垃邋砬菈瘌旯蠟臘溂鬎鞡臈楋柆翋藞蝋鑞揧儠嚹揦搚摺擸攋櫴爉瓎癩磖蝲辢镴鯻鱲"};
const unsigned char PY_mb_lai[]=  {"来赖莱來濑睐癞徕赉籁涞賴唻瀬铼瀨萊崃棶騋癩頼崍徠籟錸淶睞娕藾誺箂庲鯠賚鶆俫倈勑厲婡懶攋梾櫴猍琜筙襰逨郲釐顂鵣麳黧"};
const unsigned char PY_mb_lan[]=  {"蓝烂兰懒栏岚拦揽篮滥览澜阑缆榄谰藍蘭斓镧爛繿懶嵐婪攬褴諫灆籃漤欄儖覧濫攔壈瀾罱覽嬾欖灠闌籣纜暕躝嚂灡襴欗譋爁襤浨斕擥醂糷燗讕爦鑭僋厱啉囒坔壏孄孏幱廩廪惏懔懢涟湅漣炼煉燣爤璼瓓礷葻蘫襕襽谏郴钄韊顲"};
const unsigned char PY_mb_lang[]=  {"狼浪郎朗廊琅啷榔郞螂鎯阆莨埌崀閬锒烺塱蒗稂瑯誏羮硠鋃桹欴筤朖俍勆哴唥嫏悢朤樃樠羹脼艆蓈蓢蜋踉躴郒駺"};
const unsigned char PY_mb_lao[]=  {"老捞劳牢佬烙涝唠姥痨酪铑落醪嫪崂勞咾鐒栳撈耢簩僗潦荖労蛯络铹恅銠橑澇嘮癆浶鮱軂橯狫顟嶗僚哰嗠嘐憥憦撩朥獠珯硓磱窂粩絡耮蓼蟧轑髝"};
const unsigned char PY_mb_le[]=  {"了乐勒叻仂肋樂楽泐牞鳓鰳竻氻砳阞嘞忇扐玏簕艻韷餎饹"};
const unsigned char PY_mb_lei[]=  {"类累雷泪磊蕾嘞垒勒镭肋擂類羸淚耒酹銇诔涙纍鑸缧儡罍嫘壘畾藟檑郲灅磥礌纇蔂絫縲塁礧鐳誄樏癗蘱瓃蘲虆讄轠櫐鸓蠝礨瘣壨禷頛傫儽卢厽咧攂櫑欙洡漯盧矋祱纝脷腂蕌蘽錑鑘靁頪颣鱩鼺"};
const unsigned char PY_mb_leng[]=  {"冷楞愣棱塄稜崚堎睖薐踜倰碐輘"};
const unsigned char PY_mb_li[]=  {"里李离力理立利丽例黎礼哩粒莉梨历厉沥栗厘吏励犁俐裡荔裏笠锂骊隶狸傈璃鲤篱俪喱郦痢戾砺砾漓藜澧離莅琍俚溧禮罹蠡刂麗呖唳鹂醴曞唎栎枥蛎娌詈疬逦蓠鬲褵缡坜欐豊苈雳鳢疠悧暦猁勵歷黧厤歴粝儷隸釐浬厲嫠悷曆蜊劙籬涖篥轹瀝慄磿儮瓅苙蒞瑮剺栵鯉嚦瓥栃鲡醨濿孋扐犂謧灕礪樆鋰蘺檪砅蠣縭驪粴朸轢櫪癘讈跞癧廲岦蠫搮盭茘娳赲屴菞刕秝隷蔾邐鱧鴗鑗蜧壢峛欚礰靋漦禲蚸鬁犡藶轣鱺鵹筣糲蠇糎靂孷麜鯏竰鱱塛鷅鸝鯬蒚悝藓仂位凓列剓厯叓叕叻嚟囄囇婯峲巁悡扚捩擽攊攦攭斄柂栛梸棃棙櫔櫟氂沴沵泣淚濼灑爄爏犛珕珞瓈瓑皪盠睝矖砬硌礫穲粚綟纅纚翮脷艃荲蛠蝕蝷蟍蟸觻貍躒邌酈釃鉝銐鋫錅錑鎘鏫鑠铄镉霾颯飒鬴鱳鳨"};
const unsigned char PY_mb_lia[]=  {"俩倆"};
const unsigned char PY_mb_lian[]=  {"连练脸联恋莲链炼帘怜廉敛連濂涟琏鏈殮镰殓臉戀潋鍊楝鲢蓮奁練聯蠊堜煉斂湅臁鐮簾憐槤裢鎌裣縺蔹僆漣聨璉歛薕錬嗹謰翴鬑磏浰奩鰊匳襝瀲覝鰱摙褳澰鄻蹥萰羷嬚亷令劆匲噒娈媡嫾孌慩挛搛撿攣梿槏櫣欄溓濓熑燫瑓瞵稴籢籨纞羸聫聮膦苓莶薟蘝蘞螊譧醶镧零鱄"};
const unsigned char PY_mb_liang[]=  {"两量亮梁良凉辆靓粮俩晾谅粱兩椋靚樑魉涼悢踉両諒糧喨俍倞輛墚湸裲駺緉輌簗鍄綡啢蜋魎輬莨倆哴唡惊掚煷脼蜽蹒蹣辌閬阆"};
const unsigned char PY_mb_liao[]=  {"了聊料廖辽疗撩寮撂僚燎暸寥蓼嘹缭潦獠憭镣鐐钌瞭尥鹩繚敹療遼釕樛嫽憀摎窷尞鄝窌膫蟧膋鷯蟟嵺豂炓轑簝镽飉屪嶚飂佬僇劳勞尦嶛廫漻爎爒璙竂蟉賿蹘蹽鏐镠髎"};
const unsigned char PY_mb_lie[]=  {"列咧烈裂猎劣冽洌鬣捩趔埒睙姴躐獵儠鴷埓颲櫑迾綟毟蛚茢猟擸鮤犣例倈劦劽哷奊峢巁巤忚挒挘栗棙浖烮煭燤爄爉聗脟膊臘邋鬛鱲"};
const unsigned char PY_mb_lin[]=  {"林临琳淋霖邻磷麟拎鳞凛蔺吝啉璘膦廪赁粼臨閵檩遴懔嶙辚疄箖鄰驎亃躏燐瞵潾鱗凜繗廩菻僯賃躪悋鏻惏轔懍躙隣藺橉顲翷蹸壣暽檁碄焛甐任伈厸崊恡撛斴晽涁渗滲澟瀶獜玪痳癛癝稟粦轥阴魿麐"};
const unsigned char PY_mb_ling[]=  {"另令领灵零凌玲岭陵铃龄菱〇翎伶绫泠苓羚聆呤靈棱棂領瓴鈴蛉夌綾囹酃舲柃嶺齡淩霊鲮澪倰崚彾炩岺蕶霝笭姈軨齢皊琌詅爧醽鴒鯪蔆欞錂輘櫺砱裬婈昤蘦坽駖朎狑冷刢孁怜掕瀮燯磷祾秢竛紷蓤衑袊跉釘钉閝阾霗霛靇魿鸰鹷麢龗"};
const unsigned char PY_mb_liu[]=  {"刘留六流柳溜瘤硫陆遛琉榴浏碌劉绺馏鎏熘骝旒蓅镏瑠蹓锍媹珋鹨嵧瀏鏐栁罶澑霤鰡廇懰餾騮鶹鎦畄嚠裗藰鷚塯綹璢飀蟉磟嬼飂雡麍偻僂抡斿旈桞桺橊橮沠泖泵游漻熮瑬畂畱疁癅磂羀翏聊膢蒌蒥蓼蔞鉚鋶鐂铆镠陸飅飗駠駵驑鬸鹠"};
const unsigned char PY_mb_lo[]=  {"咯"};
const unsigned char PY_mb_long[]=  {"龙隆弄笼拢聋陇垄珑龍胧泷垅窿栊槞咙茏竜砻曨籠儱癃攏蠪瀧聾壟鑨哢巃瓏隴嚨櫳襱矓篢蠬鸗朧躘礱谾徿蘢梇豅靇鏧霳嶐篭厐壠宠寵屸巄庞总昽湰滝漋爖眬硦礲竉蕯蝕衖贚驡龐龒龓"};
const unsigned char PY_mb_lou[]=  {"楼喽漏露搂娄瘘陋篓镂樓蒌耧蝼嘍婁偻摟髅嵝廔僂瘺鏤瞜塿耬嶁螻窶艛熡鞻髏寠屚慺溇漊牢甊瘻簍膢蔞謱軁遱"};
const unsigned char PY_mb_lu[]=  {"路陆录鲁露卢炉鹿禄璐芦卤麓庐鹭噜颅虏潞掳戮撸泸橹碌漉绿赂渌逯鲈錄鸬鏀陸嚧盧垆鐪魯甪氇舻辂簬祿爐胪辘蕗六栌嚕廬镥稑鈩擄簏虜枦轳蘆櫓彔菉騄籙僇濾摝琭醁盝鹵穋鷺滷睩擼廘賂顱臚挔淥鱸坴翏纑觻鑪鏕瀘氌艫磠艪蔍璷踛轆錴壚熝轤漊硉螰蓾罏勠淕玈籚塶舮蠦蹗魲鸕艣鯥膟鵱蓼侓剹勎嗠圥塷娽峍捋捛摅攄攎椂樐樚櫨滤澛瀂獹瓐瘳矑硵箓簵簶粶緑肤膔膚虂角觮谷趢輅鄜酪録鏴鑥騼髗鱳鴼鵦黸"};
const unsigned char PY_mb_luan[]=  {"乱卵栾鸾峦銮亂滦挛孪娈欒鸞鑾脔攣巒灤羉臠孌孿圞奱曫癵乿圝灓癴脟臡薍虊覶釠鵉"};
const unsigned char PY_mb_lue[]=  {"略掠锊畧鋝剠圙寽擽率稤药藥詻鋢"};
const unsigned char PY_mb_lun[]=  {"论轮伦纶仑抡沦論綸倫輪崘囵崙惀侖淪稐棆掄圇睔錀蜦菕溣碖踚陯埨婨磮耣腀鯩"};
const unsigned char PY_mb_luo[]=  {"罗落洛咯裸骆络萝螺囉摞锣珞箩骡雒椤羅逻倮烙鏍欏镙蠃猡捋泺瘰荦漯蘿儸鑼猓欙脶絡茖駱纙峈籮犖皪礫儽邏攭臝詻覶鸁跞鮥蓏鱳腡騾攎剆玀鵅硌乐啰挼捰攞曪果格樂橐櫟濼烁爍癳砢硦碌笿蛒蜾蝸蠡袼覼路躒躶鉻鎯铬頱饠驘"};
const unsigned char PY_mb_lv[]=  {"率绿吕铝驴旅律屡氯履滤虑侣缕捋闾綠褛呂垏寠榈屢慮繂閭驢絽偻縷膂嵂稆録侶鋁儢緑櫨梠褸葎勴簍謱藘膢慺櫚哷蔞瘻郘祣鑢鷜穭卛卢壘娄婁寽庐廬曥樓櫖氀焒爈盧瞜穞箻篓累膐蒌軁鏤镂馿魯鲁鹿"};
const unsigned char PY_mb_lve[]=  {"略掠锊剠圙寽擽率畧稤药藥詻鋝鋢"};
const unsigned char PY_mb_m[]=  {"呒嘸呣"};
const unsigned char PY_mb_ma[]=  {"吗嘛马妈骂码麻玛嗎抹馬么媽麽罵杩蟆蚂碼瑪孖鎷犸傌嘜嬤痲犘摩禡螞痳鬕蟇鷌溤榪礣唛嬷亇呐嫲尛獁睰祃蓦蔴貉貊遤閁靡駡驀鰢麼"};
const unsigned char PY_mb_mai[]=  {"买卖麦埋迈脉劢唛霾買賣麥売脈荬邁勱霢嘪鷶佅咪哩派蕒薶衇貍霡"};
const unsigned char PY_mb_man[]=  {"慢满蛮曼漫瞒蔓螨熳幔鳗滿蠻谩馒嫚缦鬘颟顢鏝姏墁镘埋僈縵瞞睌謾慲獌蘰矕鰻樠蟃屘饅鬗鞔幕悗摱槾満澫澷絻蔄蟎襔蹒蹣鄤鏋"};
const unsigned char PY_mb_mang[]=  {"忙盲芒莽茫蟒氓厖漭笀邙硭鋩牻硥汒駹蠎龒哤杗蘉娏痝蛖壾吂尨庬恾朚朦杧浝牤狵甿盳瞢茻莾釯铓鸏鹲龍龙"};
const unsigned char PY_mb_mao[]=  {"毛猫冇冒茂帽茅矛貌贸卯锚懋铆貓昴旄茆瑁峁髦耄牦袤泖蟊瞀氂秏蝥楙芼鄚眊鄮貿媢犛冐皃錨酕蓩鉚軞枆毷渵蝐鶜侔冃勖務堥夘嵍愗戼描暓毣牟獏笷緢罞耗萺蛑覒貇鉾霿髳"};
const unsigned char PY_mb_me[]=  {"么麽麼嚜嚒嚰孭庅濹癦"};
const unsigned char PY_mb_mei[]=  {"没每美梅妹煤眉酶枚媚霉媒玫镁沒魅昧寐湄莓袂楣浼沬嵋脢媺毎鎂媄渼糜鹛煝郿眛镅苺楳猸禖黴瑂徾痗挴燘蘪躾栂腜蝞塺堳攗凂呅味嚜坆坶墨嬍嵄抺攟某槑櫗氼湈溦珻眊睂睸矀祙篃羙脄膴葿跊鋂鎇韎鬽鶥黣"};
const unsigned char PY_mb_men[]=  {"们门闷焖們門扪満悗悶懑亹鞔暪钔菛鍆燜殙捫璊懣椚虋怋惛汶满滿玟玣玧瞞穈閅"};
const unsigned char PY_mb_meng[]=  {"梦猛蒙孟盟萌锰懵檬夢朦勐濛虻蠓甍瞢礞艋蜢曚氓儚鼆矇艨懞幪萠鋂甿鄳罞庬錳饛蕄鄸氋鸏霥瓾冡夣嫇尨懜掹擝明橗溕獴瞑矒莔蝱蟊蟒雺霚霧霿靀顭髳鯍鯭鱦鹲黽黾"};
const unsigned char PY_mb_mi[]=  {"米迷密咪蜜秘谜弥觅眯靡糜醚尓糸祢幂宓泌蘼谧弭芈汨嘧麋脒汩櫁冪尒謎彌縻覓敉瞇猕祕幎羋瀰謐穈冞蓂灖渳爢蔤蔝鼏覛麛榓幦峚漞銤滵醾樒羃葞獼蝆熐塓麊鸍侎冖劘哋孊宻尔幺戂摩摵擟擵攠檷沕沵洣淧溟濔濗爾獯瓕眫眽瞴禰簚籋粎罙苾蒾藌袮覔詸辟醿釄鑖镾"};
const unsigned char PY_mb_mian[]=  {"面免棉眠绵缅勉冕眄婂沔腼麵娩俛緬綿湎丏喕偭媔鮸渑櫋麺矊愐緜矏蝒靦葂麪黾冥勔厸嬵宀檰汅泯湣澠牑瞑矈糆絻緍緡缗臱芇莬蠠靣麫黽"};
const unsigned char PY_mb_miao[]=  {"秒苗妙庙喵瞄描淼渺缪邈藐缈鹋眇杪廟嫹緲訬媌竗篎鱙仯吵庿彯猫玅紗緢纱蜱鶓"};
const unsigned char PY_mb_mie[]=  {"咩灭乜蔑滅篾搣蠛懱幭衊薎鱴吀咪哶孭櫗瀎眜覕谂鑖鴓"};
const unsigned char PY_mb_min[]=  {"民敏闵闽珉抿旻泯皿岷悯憫敃愍缗玟黾笢湣旼崏苠閔潣敯緡閩鳘僶暋黽罠鈱蠠錉琝怋刡痻簢冧冺勄呡垊姄忞慜捪汶渂湏琘瑉盷盿眠砇碈笽緍繩绳賯鍲鰵鴖"};
const unsigned char PY_mb_ming[]=  {"名明命鸣铭冥茗溟螟暝瞑洺酩銘鳴姳掵詺眳蓂覭榠嫇鄍慏佲凕朙猽眀萌"};
const unsigned char PY_mb_miu[]=  {"缪谬繆謬"};
const unsigned char PY_mb_mo[]=  {"莫摸魔末膜磨模墨抹摩默没沫陌漠馍茉摹麽谟銆蘑殁寞脉蓦么嫫耱嬷鏌妺貘貊莈秣镆黙靺冒攠歿万謨麿絔眽粖瘼劘枺藦嗼驀纆袹糢暯狢瀎饃瞙蟔蛨塻絈髍爅嘿貉伯佰劰勿嚤嚩圽嫼尛帓帕帞怽懡戂抚撫擵昧昩橅歾沒無百皌眜眿瞐砞礳縸艒藐蟆袜謩譕貃貈貌鞨饝魩魹麼"};
const unsigned char PY_mb_mou[]=  {"某谋眸牟哞侔謀鍪蛑缪洠鉾麰鴾件劺厶呣堥婺恈敄桙毋瞴繆蟱袤鞪"};
const unsigned char PY_mb_mu[]=  {"木母目亩穆墓姆慕牧幕暮沐募钼睦牡牟拇模苜呒畝仫坶霂莯牳毪幙縸踇鉬茻獏毣萺凩鉧炑楘砪氁峔蚞鞪艒姥畆慔嘿墲娒婺朷樢狇畒畞畮繆缪胟雮"};
const unsigned char PY_mb_n[]=  {"嗯唔咹哏"};
const unsigned char PY_mb_na[]=  {"那拿哪纳娜呐钠捺衲納拏肭雫镎靹鈉笝秅魶貀軜豽呢乸內内南吶呶嗱妠抐挐淰笚箬篛絮蒘蒳袦訤詉誽蹃郍鎿"};
const unsigned char PY_mb_nai[]=  {"乃奶耐奈萘氖鼐柰倷艿迺褦佴廼渿孻耏釢錼妳哪嬭掜搱摨熋疓能腉螚"};
const unsigned char PY_mb_nan[]=  {"男难南喃楠囡難腩囝柟赧蝻莮娚湳枏嫨諵暔妠戁婻遖萳抩揇侽弇摊攤枬滩灘煵畘颌"};
const unsigned char PY_mb_nang[]=  {"囊囔馕曩涳攮擃嚢齉灢鬞乪儾哝噥崀憹搑欜瀼蘘蠰譨饢"};
const unsigned char PY_mb_nao[]=  {"闹脑挠恼孬瑙呶淖鬧铙腦脳垴猱悩婥嫐閙蛲硇惱臑夒撓蟯碙嶩碯鐃峱獿匘堖巎巙怓憹橈檂浇澆獶腝蝚詉譊"};
const unsigned char PY_mb_ne[]=  {"呢哪呐讷吶訥眲那抐疒疔"};
const unsigned char PY_mb_nei[]=  {"内那內馁哪餒氝腇娞婑浽脮錗餧鮾鯘"};
const unsigned char PY_mb_nen[]=  {"嫩恁媆嫰枘腝臑"};
const unsigned char PY_mb_neng[]=  {"能螚竜而耐"};
const unsigned char PY_mb_ng[]=  {"嗯唔"};
const unsigned char PY_mb_ni[]=  {"你拟尼呢泥妳妮腻逆倪昵匿霓溺袮睨铌旎坭児鲵怩伲嬭猊膩擬灄齯貎隬暱迡嫟苨柅晲惄檷麑縌薿誽婗馜抳郳鯢狔蜺眤鈮跜堄秜觬臡屔濔籾淣祢慝伱儗儞兒埿嬺孨孴屰嶷彌愵懝抐掜棿氼滠濘瀰痆禰聻胒腝蚭蛪譺輗鉨鑈镾"};
const unsigned char PY_mb_nian[]=  {"年念粘廿捻黏碾蔫撵拈唸卄辇辗鲇鲶埝姩撚哖鮎蹍輦跈鯰攆簐秊躎捵榐涊淰溓痆秥艌趁趂蹨輾鵇"};
const unsigned char PY_mb_niang[]=  {"娘酿孃嬢釀醸"};
const unsigned char PY_mb_niao[]=  {"鸟尿嬲脲袅溺鳥茑褭蔦嫋裊嬝樢尥尦茮"};
const unsigned char PY_mb_nie[]=  {"捏聂涅镍孽乜颞啮嗫蘖蹑镊臬鑷鎳摰聶摄敜陧讘苶囓嚙齧躡櫱巕臲嵲峊踂孼蠥糱隉踙踗篞鑈嶭闑顳倪喦噛囁囐囡圼埝嵒帇幸惗捻掜揑摂攝枿棿槷痆籋糵肀菍褹諗鉨鉩銸鋷錜钀"};
const unsigned char PY_mb_nin[]=  {"您拰恁囜脌"};
const unsigned char PY_mb_ning[]=  {"宁凝拧柠甯佞咛寧狞苧泞寗侫儜擰聍檸寍嚀聹嬣薴獰濘鑏鸋苎冰寕寜年攘橣澝疑矃鬡鬤"};
const unsigned char PY_mb_niu[]=  {"牛妞扭纽钮拗忸狃鈕紐怓杻炄抝汼沑牜莥蚴靵"};
const unsigned char PY_mb_nong[]=  {"弄农侬浓脓哝濃農儂膿襛穠噥醲繷齈咔憹挊挵欁癑禯秾莀蕽辳"};
const unsigned char PY_mb_nou[]=  {"耨譨鎒羺啂嬬搙擩槈檽獳譳鐞"};
const unsigned char PY_mb_nu[]=  {"怒奴努弩驽胬孥帑砮笯駑仅伖伮傉呶搙擩褥詉"};
const unsigned char PY_mb_nuan[]=  {"暖奻渜餪湪濡煖煗"};
const unsigned char PY_mb_nue[]=  {"虐疟瘧婩硸"};
const unsigned char PY_mb_nuo[]=  {"诺挪喏糯傩懦諾锘搦娜儺梛懧糑袲逽橠吶呐堧媠嫷愞掉掿搙搻榒毭渪稬穤糥耎袳蹃那郍鍩难難需"};
const unsigned char PY_mb_nv[]=  {"女钕籹衄釹恧朒衂聏沑狃絮肭"};
const unsigned char PY_mb_nve[]=  {"婩疟瘧虐"};
const unsigned char PY_mb_o[]=  {"哦噢喔嚄筽"};
const unsigned char PY_mb_ou[]=  {"偶欧藕呕鸥殴耦瓯沤鏂区歐怄讴藲櫙嘔毆蕅鷗鴎甌漚熰吘慪腢區吽塸抠握摳敺渥澫紆纡膒蓲謳遇醧齵"};
const unsigned char PY_mb_p[]=   {"批平判潘彭庞裴蒲配片派破排品皮喷盘偏评怕培普贫跑炮"};
const unsigned char PY_mb_pa[]=  {"怕爬帕趴啪扒耙琶葩掱杷帊筢钯袙鈀舥跁汃叭吧妑把派潖皅芭苩"};
const unsigned char PY_mb_pai[]=  {"拍派排牌哌湃徘俳迫蒎棑簰犤鎃箄啡椑猅脾腗輫"};
const unsigned char PY_mb_pan[]=  {"盘潘判盼攀畔叛磐番泮蟠胖爿丬盤袢牉媻槃幋襻籓拚蹒磻牓鞶跘溿頖褩詊眅沜蹣碆縏蒰坢瀊乑伴冸半卞姍姗审宷審弁彦扳拌搫柈洀湴瀋炍片畨皤盻眫繁膰般螌踫鄱鋬鎜鑻闆鵥"};
const unsigned char PY_mb_pang[]=  {"胖旁庞滂逄乓彷嗙膀磅螃尨雱耪龐汸徬夆舽仿傍厐嫎彭房方沗炐篣肨胮膖蒡蠭覫趽逢鎊镑霶髈鰟鳑龎"};
const unsigned char PY_mb_pao[]=  {"跑泡抛炮袍刨疱庖咆拋脟狍匏褜炰嚗砲脬瓟萢麃鉋垉袌鞄皰奅蚫麭穮颮包抱摽爮犥礟礮窌胞苞藨謈軳铇飑鮑鲍麅"};
const unsigned char PY_mb_pei[]=  {"陪配赔培佩裴呸沛胚珮辔霈醅旆姵帔伂賠衃锫俖浿轡蓜柸茷琣裵陫毰怌倍啡坏垺妃妚婄媐嶏抷掊攈斾昢棑淠犻琲笩肧艴茇蜚錇阫馷駍"};
const unsigned char PY_mb_pen[]=  {"喷盆噴湓衯呠歕翉葐翸吩喯本汾濆瓫"};
const unsigned char PY_mb_peng[]=  {"碰彭鹏捧朋棚蓬烹硼澎砰膨篷嘭芃椪踫堋怦抨鵬弸蟛傰剻磞摓絣輣錋熢漰韸匉痭鬅搒軯篣髼憉恲閛鑝掽駍樥皏亨倗傍塜塳庄挷旁梈椖槰泙淎淜滂漨硑稝竼纄胓苹荓莑蟚軿輧迸逢逬韼騯鬔"};
const unsigned char PY_mb_pi[]=  {"皮批屁披脾劈匹癖坯辟疲痞丕啤毗僻譬噼圮铍邳陂霹琵蜱嚭罴伾媲崥鼙鈹仳淠甓枇裨庀砒郫纰伓笓毘陴埤蚍貔紕疋睥澼闢毞鎞諀羆鈚憵蚾阰鴄膍錍蚽岯鈲粃駓猈稫箆鵧狉秠豼揊銔蠯礔鷿螷否髬魾銢擗吡芘俾副卑噽嚊坏培壀妚嫓嶏帔庇庳怶悂扑抷拂旇朇枈椑榌比渒潎濞炋焷狓疈痦痺睤磇礕秛篦篺簲罷翍耚肶脴腗苉苤萆蕃蚌螕被豾鄱釽鈈鉟錃钚隦鞞頗顖颇魮鮍鲏鸊"};
const unsigned char PY_mb_pian[]=  {"片篇骗偏便翩骈谝騙扁胼楄蹁犏楩諞諚緶璸媥跰猵貵駢骿騈鶣缏囨平徧腁萹蝙褊覑賆辩辯騗魸"};
const unsigned char PY_mb_piao[]=  {"票飘漂朴嫖瞟瓢剽缥殍飄嘌螵骠薸謤僄飃莩縹髟慓顠彯翲魒醥皫驫篻蔈旚犥勡徱摽潎磦膘闝驃骉"};
const unsigned char PY_mb_pie[]=  {"撇瞥丿苤氕嫳潎暼覕撆肺蔽鐅"};
const unsigned char PY_mb_pin[]=  {"品拼频贫聘嫔颦姘拚牝嬪蘋榀頻貧嚬玭矉顰砏驞礗匕娉朩汖泵琕穦薲馪"};
const unsigned char PY_mb_ping[]=  {"平凭评瓶屏萍坪苹娉乒枰呯鲆憑評倗帡俜甁洴泙屛岼砯玶蓱頩軿鉼荓淜輧鮃缾蛢甹郱艵塀涄竮冯凴娦帲幈慿檘焩砰硑秤箳簈聠胓蘋蚲馮"};
const unsigned char PY_mb_po[]=  {"破坡颇婆泼迫魄巿泊珀攴粕皤叵鄱陂钋頗泺搫潑櫇朴笸昢钷哱桲尃髆謈岥醱濼繁溌翍蒪岶猼馞釙鏺烞嘙奤娝尀屰廹敀椺洦淿湐溥皛砶膊蔢跛酦鉕霸駊"};
const unsigned char PY_mb_pou[]=  {"剖抔婄掊棓裒垺襃捊吥咅哣培堷抙抱涪犃箁裦褒踣部郶錇锫颒"};
const unsigned char PY_mb_pu[]=  {"普铺扑谱浦蒲朴噗瀑仆葡璞圃濮埔溥曝莆菩脯堡蹼撲氆镨匍譜纀鋪樸舖僕鐠暴酺墣潽镤襆蒱抪舗鵏鯆痡烳駇獛鏷瞨剝剥卜圑圤巬巭扶捗擈攴攵暜柨檏炇甫砲秿穙箁苻荹菐蜅襥諩豧贌陠"};
const unsigned char PY_mb_q[]=   {"起前其钱乔齐祁秦屈邱戚瞿去气全期群情区强切取七求清确权且青"};
const unsigned char PY_mb_qi[]=  {"其起期气器七齐奇骑妻启旗企棋漆弃琪琦岂戚祁汽绮欺契泣祈砌祺淇柒崎栖乞岐麒脐歧鳍凄畦亓骐杞沏耆氣迄圻嘁讫颀憩欹芪綦齊葺掑萁忔祇蛴桤汔蕲碛旂碁蹊啟棄騎槭気荠蟿蜞屺綺萋豈跂埼芑湇攲済啓倛悽玘騏俟斉棲棨唭騹亟稽碕湆娸鬐噐淒憇敧迉訖僛懠鰭盵臍棊郪婍禨慽蚚璂觭諆竒芞缉愒蚑扢毄呇慼鏚鼜躩榿鄿鬿藄纃栔疧褄朞緕肵咠桼鬾肐磎魌蟣捿緀邔焏岓濝籏釮鯕磧隑魕玂踑軝頎鵸罊稘蠐霋鶀甈艩麡鶈綮丌亝伎偈傶切刺剘勤吃吱呮唘啔喰夡宿嵜己帺忮忯忾恓恝愭愾扱扺技抵拞挈揭摖支斊晵暣枝梩檱櫀欫洓济渍渏滊漬濟炁猉甭畸盀矵碶磜磩礘示禥簯簱粸紪絜綥綨緝缼舙萕薺蘄蚔蜝螇螧衹袳裿褀諬諿趞趿踖踦躤軙逗錡鐖锜闙饑鮨鲯齮"};
const unsigned char PY_mb_qia[]=  {"掐恰洽卡髂葜袷冾帢鞐鮚愘硈殎酠伽佉價咭圶客抲拤挈揢搳擖楬疴矻磍絜跒鲒"};
const unsigned char PY_mb_qian[]=  {"钱前千签欠浅牵迁潜倩铅谦乾茜遣黔嵌纤钳仟歉骞芊虔芡錢谴钎堑阡悭褰佥灊钤搴扦簽墘箝荨遷牽嗛缱淺愆慊靬謙掮蒨仱潛箞鉛銭槧傔肷汧刋椠揵岍鉗僉拑犍奷籤輤挳騫鈐唊棈鰜檶媊縴譴歁櫏葥繾岒韆鑯軡朁揃欿塹濳篏婜蕁騝篟顅雃馯籖竏鐱粁騚黚鑓攓蜸鶼攐鰬榩鬈乹伣俔偂儙凄凵厱圱圲壍嬱孅孯寨嵰廞忏忴悓慳扲拪掔摼撁撍撖攑杄杴柑槏橬欦歬汘涔淒渐湔漸濽灒炶煔熑燂燫皘筋綪羟羥羬脥腱膁臤艌苂茾荕葴蔳藖蚈蚙諐谸赶釺鈆鉆鋟錎鍼鎆鏲锓開鬜鬝鳒鳽鵮鹐鹣齦龈"};
const unsigned char PY_mb_qiang[]=  {"强抢枪墙腔呛羌蔷羟強炝锵樯嫱搶唴戗牆戕镪槍嶈跄蜣彊嗆墻襁繈锖牄鎗矼瑲墏繦嬙漒鏹鏘斨檣薔鶬戧謒羥蹌蹡艢羻椌錆熗蘠創勥哐啌嗴將庆廧慶控摤摪殻溬爿猐獇玱琷箐篬羗羫蔃親跫顩鸧"};
const unsigned char PY_mb_qiao[]=  {"桥敲巧乔瞧翘俏窍侨撬鞘樵悄跷谯峭愀锹橇壳荞峤橋喬憔殼诮翹蟜墝噭礉墽劁硗僑鞒繑譙磽蹻燋潐竅趫蹺帩荍誚摮蕎磝鍬缲譑犞嫶嶠雀嘺鄡礄躈釥幧趬髜頝踍郻偢僺削勪喿塙墧嵪幓愁招捎搞撽敫校槗橾毃毳焦焳燆癄睄硚硝碻窯箾繰茭菬蕉藮跤踃鄗鄥醮銚鍫鏒鐈鐰铫陗鞩鞽韒顤顦驕骄骹髚"};
const unsigned char PY_mb_qie[]=  {"且切妾窃茄怯緁鍥惬锲箧挈郄鐑趄竊洯厒倢椄朅慊篋癿疌踥蛣蛪愜藒鯜伽砌倿偼匧唼喋契婕媫帹悏捷沏淁漆稧穕笡籡聺脞苆蕺詧跙魥鰈鲽"};
const unsigned char PY_mb_qin[]=  {"亲秦琴勤钦沁侵寝禽覃芹擒嗪衾噙親芩溱揿笉撳寢寑瘽儭吣欽慬檎廑螓锓靲懃墐矜忴駸瀙頜蘄唚庈昑扲梫嶔櫬菳澿藽斳埁顉耹鋟蚙埐螼鈙菣鳹嶜坅肣雂厪吢堇媇嫀寴嵚廞懄抋捦搇槿橬浸涁渗滲濅珡琹矝綅臤菦蓁蕲蠄衿誛赺赾鈂鈊顩颌骎鬵鮼"};
const unsigned char PY_mb_qing[]=  {"请清情轻青庆晴倾卿氢擎請氰顷苘磬箐漀輕罄氫慶黥傾亲謦檠凊勍圊靑蜻淸鲭綮頃鑋靘渹碃掅郬樈廎硜葝擏倩儬剠啨埥声夝媇寈庼暒棾檾櫦殑殸涇濪玪甠硘精綪胜莔軽鯖鶄"};
const unsigned char PY_mb_qiong[]=  {"穷琼穹邛茕蛩窮跫瓊銎筇煢藭璚舼蛬惸憌藑瞏橩笻桏赹儝卭嬛宆焪焭熍琁瓗睘竆鞠"};
const unsigned char PY_mb_qiu[]=  {"球求秋邱丘裘囚仇糗泅酋虬遒楸逑鳅萩湫毬俅巯犰赇蚯銶龟蝤捄絿鼽璆崷坵殏莍逎訄緧賕鰍虯觩巰煪鰽朹蟗鞦觓媝趥恘紌梂唒釓蛷蠤穐蝵鰌釚龝鯄盚鶖鮂丠区厹叴团宿寈惆愀扏搝櫹氽氿汓浗渞湬湭牫玌皳秌篍肍艽蓲蘒訅趜邺醔釻钆鞧馗鱃鳩鵭鸠鹙龜"};
const unsigned char PY_mb_qu[]=  {"去区取曲佢娶屈渠趋趣驱祛瞿蛆躯龋衢區觑黢麴迲阒闃蘧璩嶇袪佉诎脥灈呿氍蕖紶朐劬蛐趨彡鼩詘岖鸲麹敺驅蠼軀癯磲臞覷鮈跼苣駆浀麮趜鐻欋趍胠翵螶鼁郥籧躣匷抾蟝軥刞匤絇髷鴝竘蠷焌鶌鱋菃阹駈淭葋齲坥斪戌伹厺句岨岴巨弆忂怚憈戵欪毆璖竬筁粬組组翑耝胊蚼蜡蝺衐覰覻詓誇誳跔跙遽鉤鑺閴鞠鞫騶驺魼鰸鸜麯"};
const unsigned char PY_mb_quan[]=  {"全权圈劝泉犬拳券荃醛蜷铨犭诠佺绻颧權筌勸痊悛鬈巻棬圏権惓牷弮詮牶辁烇埢畎銓湶踡婘顴腃絟汱矔勧觠綣姾瑔蠸輇酄鐉椦犈齤虇縓楾巏駩韏卷啳圳孉峑恮拴捲搼栒桊槫洤灥獾琯甽硂純纯葲謜譔跧闎騡鰁鳈鸛鹳"};
const unsigned char PY_mb_que[]=  {"却缺确雀卻阙瘸鹊阕炔榷悫皵確埆闕闋礐愨塙殻鵲蒛毃硞碻礭躤蚗慤搉傕决墧屈崅攉敠汋決燩猎獡碏舃舄芍趞踖隺鳥鸟"};
const unsigned char PY_mb_qun[]=  {"群裙夋囷逡麇羣箘麕宭峮帬歏裠踆輑遁麏"};
const unsigned char PY_mb_ran[]=  {"然染燃冉髯苒蚺姌熯呥袡髥珃冄卪嘫媣柟橪繎肰舑蒅蚦衻袇蹨"};
const unsigned char PY_mb_rang[]=  {"让讓嚷壤瓤攘穰禳譲瀼蘘勷壌懹獽穣躟爙鬤儴孃忀欀纕蠰鑲镶"};
const unsigned char PY_mb_rao[]=  {"绕饶扰桡娆繞荛饒擾遶橈嬈犪襓隢挠撓穘繚缭蕘蟯"};
const unsigned char PY_mb_re[]=  {"热惹熱喏偌捼渃若蹃"};
const unsigned char PY_mb_ren[]=  {"人任忍认仁刃韧壬刄仞紝妊稔亻荏纫轫衽認葚仭饪姙韌屻芢腍牣涊軔栠扨袵紉綛銋荵訒靭肕飪靱鵀儿忈忎恁朲杒栣梕棯秂秹絍纴菍讱躵釰鈓餁魜"};
const unsigned char PY_mb_reng[]=  {"仍扔礽陾芿戎穰耳艿辸"};
const unsigned char PY_mb_r[]=   {"人如日阮荣认入任热然容让润弱燃染壤绕仁溶刃仍"};
const unsigned char PY_mb_ri[]=  {"日鈤馹囸氜釰驲"};
const unsigned char PY_mb_rong[]=  {"荣容融蓉溶绒榕熔戎茸嵘冗榮蝾肜瑢栄狨嫆傇鎔媶絨毧瀜褣軵嶸爃穃茙峵榵髶蠑氄羢烿駥镕傛坈嬫宂嵤巆搈搑摉曧穁縙縟缛螎隔頌颂"};
const unsigned char PY_mb_rou[]=  {"肉柔揉厹鍒糅蹂鞣粈禸葇宍煣媃輮蝚楺騥鰇髳鶔莥韖渘瑈瓇腬鑐"};
const unsigned char PY_mb_ru[]=  {"如入乳汝儒茹辱濡孺褥蠕嚅襦嬬洳溽铷缛蓐侞嗕曘媷込薷銣筎帤袽擩挐鄏颥獳蕠縟醹鴽杁蒘鳰偄吺咮女嶿扖月桇檽渪燸繻肉肗臑邚鑐需顬鱬鴑"};
const unsigned char PY_mb_ruan[]=  {"软阮朊軟堧檽耎緛壖瓀蝡燸礝偄媆嫰愞撋渪濡瑌碝腝輭需"};
const unsigned char PY_mb_rui[]=  {"瑞锐睿蕊芮蕤緌叡蚋汭枘銳兊桵蕋橤蘂繠兌兑內内壡婑惢抐撋棁甤笍綏绥苼蘃蜹踒鈉鋭鏸钠"};
const unsigned char PY_mb_run[]=  {"润闰潤閏閠橍撋"};
const unsigned char PY_mb_ruo[]=  {"若弱偌箬爇婼渃蒻鄀篛楉撋鶸鰯嵶叒惹挼捼溺焫芮鰙"};
const unsigned char PY_mb_s[]=   {"是上时孙宋苏沈粟施邵佘申师帅沙隋石史生说社深水所三十使事数四实少式山手"};
const unsigned char PY_mb_sa[]=  {"撒萨洒仨卅飒薩灑摋颯脎靸挲馺攃隡桬檫櫒殺泧潵纚蔡蕯訯躠鈒鎝鏾钑霅鞈"};
const unsigned char PY_mb_sai[]=  {"赛塞噻腮鳃賽僿毢揌顋嗮嘥思愢毸簑簺鰓"};
const unsigned char PY_mb_san[]=  {"三散伞叁彡氵傘糁繖馓毵帴鬖鏒毿糂糝閐霰俕傪厁参參叄叅壭弎橵毶潵犙糣糤蔘謲鏾饊"};
const unsigned char PY_mb_sang[]=  {"桑丧嗓搡喪颡褬磉顙鎟桒槡纕"};
const unsigned char PY_mb_sao[]=  {"扫骚嫂搔臊瘙掃騷缫埽鳋溞懆矂騒缲髞掻鐰鄵慅氉鱢梢哨橾煰燥縿繅繰颾鯵鰠鰺鲹"};
const unsigned char PY_mb_se[]=  {"色瑟涩塞啬拺铯濇穑澀銫渋粣鉍譅嗇璱澁穡濏栜廧鏼轖飋寨愬懎擌槭歮歰泣洓渍溹漬瀒琗瘷穯繬蔷薔虩鎍鎩铋铩闟雭"};
const unsigned char PY_mb_sen[]=  {"森掺摻槮渗滲篸襂"};
const unsigned char PY_mb_seng[]=  {"僧鬙"};
const unsigned char PY_mb_sh[]=   {"数厦山删商少召社设甚声市师始手收守书属术输双水谁睡税顺"};
const unsigned char PY_mb_sha[]=  {"啥杀傻沙砂纱煞莎刹厦鲨痧殺唦猀霎裟濈紗剎铩箑鯊唼歃乷杉繌翣喢硰挲菨萐蔱翜樧嗄倽儍啑噎帹廈挱接摂摄摋攝榝粆繺賒賖赊鎩閯閷霅魦鯋"};
const unsigned char PY_mb_shai[]=  {"晒筛曬色酾簁篩攦閷繺骰摋殺簛籭術諰"};
const unsigned char PY_mb_shan[]=  {"山删闪善衫扇珊杉陕擅栅姗疝膳煽汕鳝缮跚单膻掸赡苫骟搧讪蟮睒閃刪嬗樿剡芟彡钐墠鄯鐥潸笘禅僤敾纔単繕掞晱舢墡煔姍羶埏柵剼陝攙贍猭痁穇赸襂譱訕鱔灗閊圸蔪謆杣騸髟覢饍狦掺傓僐儃儋單嘇壇嶦幓挻搀摻擔曏曑椫檀檆櫼潬澘澹炶烻熌磰禪笧縿羴脠葠蟬蟺襳軕邓邖釤銏閄顃顫颤鯅鱓鱣鳣"};
const unsigned char PY_mb_shang[]=  {"上商伤尚赏殇裳熵觞墒傷晌绱賞仩垧尙殤汤塲慯觴謪蠰鬺螪蔏恦丄场埫場愓扄湯滳漡禓緔踼鑜鞝"};
const unsigned char PY_mb_shao[]=  {"少烧稍邵绍勺哨梢韶捎芍劭苕燒杓召蛸紹潲艄卲筲焼鞘弰旓髾玿輎蕱袑鮹佋削娋招搜柖溲燿睄笤綃綤绡莦萔萷鞩韒颵"};
const unsigned char PY_mb_she[]=  {"设社射蛇舍摄舌涉佘奢赦赊慑畲折麝歙攝設厍闍滠厙捨涻揲蠂舎渉賒懾韘猞蔎檨輋挕慴騇奓弽抴拾摂摵欇灄畬睫碟磼聂聶葉虵蛞蛥賖阇鞨"};
const unsigned char PY_mb_shei[]=  {"谁"};
const unsigned char PY_mb_shen[]=  {"神深沈身甚申肾伸审什慎渗谂婶砷参珅绅燊哂屾莘呻蜃柛諗鰰審兟诜矧糁腎侁脤胂榊妽娠蔘幓椹嫀甡伔渖葚嬸淰綝棯侺槮滲堔訷紳瀋鯓愼抌詵葠氠讅瞫罧駪眒邥鰺覾峷曋祳鯵鋠籸信參叄叅吲嘇姺孞宷弞扟抻搷昚椮涁甧瘆瘮眘瞋矤穼籶罙蓡薓蜄裑訠谉鉮震頣魫鯅鲹鵢黮"};
const unsigned char PY_mb_sheng[]=  {"生省声升胜盛圣剩绳晟笙聖牲聲昇勝甥乘枡嵊眚泩偗剰陞繩湦賸渻憴鉎渑乗貹呏焺譝澠橳鼪曻鵿丞冼垩墭姓娍媵斘晠榺殅殸狌珄琞甸竔箵縄苼蕂鍟阩陹鱦"};
const unsigned char PY_mb_shi[]=  {"是时事使市式试石十室师诗食史世实施视氏士湿失识饰始屎势适尸仕拾示時释似逝狮誓侍嗜驶蚀矢什拭虱噬匙恃柿礻弑丗饣谥詩師實湜轼峙飾舐試豕視適莳識铈筮蓍釋寔殖褷忕実勢屍埘奭濕辻諟溡弒栻崼塒蝕炻鲺駛螫獅鲥諡贳簭祏酾咶溼遰鍉蒔飭湤釈恀榯蝨鉽鰣澨笶忯鰤葹鈰觢鼭絁鼫邿襫枾貰遾釃鮖鎩溮篒軾鳲榁竍襹餝鶳揓嘘烒乨亊佀佦兘冟卋厔叓呞呩唑啇噓埶堤姼媞嬕宩宲寺峕嵵彖徥惿戺提斯旹昰柹楴檡汁沶洂浉液澤煶狧狶瑡畤痑眂眎眡睗禵秲笹筛箷篩籂籭繹绎耆肢胑舍舓蒒褆訑謚赫跩遈遞郝醳釶鉂鉃鉇鉈鉐銴鍦铊铩飠餙饬馶魳鯴鰘鳾鸤齛齥"};
const unsigned char PY_mb_shou[]=  {"收手受首瘦守售兽寿授熟収扌狩绶痩壽艏獸綬獣嘼垨夀掱敊涛涭濤膄醻鏉"};
const unsigned char PY_mb_shu[]=  {"书数树输属熟术舒鼠叔淑束疏署述竖俞蜀梳孰殊姝恕赎暑漱薯墅枢庶抒曙戍書數澍蔬氀塾黍樹丨倏纾屬菽沭輸沐殳術秫紓鼡疋豎腧摅毹潻綀樞朮贖糬疎鉥婌杸橾癙陎璹鄃竪襡軗鏣攄虪踈襩裋怷跾焂鮛鵨鶐侸俆俶倐儵兪咰售嗽娶孎尌尗庻忬悆捈捒掓揄暏朱杼柕毺涑潄潏濖瀭瑹稌籔紵絉翛荗荼蒁蒣薥薮藪藷蠴蠾謶豫透野錰鐲镯除隃鱪鱰鷸鸀鹬"};
const unsigned char PY_mb_shua[]=  {"刷耍唰唆涮誜选選"};
const unsigned char PY_mb_shuai[]=  {"帅甩摔衰率蟀帥卛綏縗绥缞"};
const unsigned char PY_mb_shuan[]=  {"栓拴涮闩閂專栒槫汕腨踹"};
const unsigned char PY_mb_shuang[]=  {"爽双霜雙孀泷滝塽孇樉驦漺礵慡艭灀縔鷞傱欆淙瀧鏯騻骦鸘鹴"};
const unsigned char PY_mb_shui[]=  {"谁水睡税说誰氵稅涗帨脽閖裞娷挩捝氺涚祱說説"};
const unsigned char PY_mb_shun[]=  {"顺舜瞬吮巛順楯蕣橓輴瞚鬊俊巡廵恂眴瞤"};
const unsigned char PY_mb_shuo[]=  {"说說硕朔烁数铄槊搠妁蒴碩爍鎙哾嗍嗽欶汋洬溯濯燿獡療矟箾药萷藥説銏鑠"};
const unsigned char PY_mb_si[]=  {"死四思斯似司丝寺私撕肆巳嗣饲祀食泗厮厶嘶纟俟伺锶驷姒汜涘絲耜笥兕俬価偲咝澌缌鸶洍蛳虒儩颸廝飼柶竢駟泀鼶緦凘媤楒貄蕬蟴梩禠覗蕼鉰肂禗榹罳螄鷥亖以佀佁傂厕厠台噝娰孠徙恖愢杫析枱泤瀃燍牭磃祠禩簛糸糹罒肄菥蜤螔蟖謕逘釲鈶鈻銉銯鋖鍶鐁雉飔飤飴饴騃騦鷉麗"};
const unsigned char PY_mb_song[]=  {"送宋松颂诵耸嵩怂讼淞崧菘悚竦凇誦忪鎹鬆頌愯娀訟聳傱倯枩濍鍶漎硹慫駷棇憁蘴蜙嵷吅庺憽捒捴揔摗枀柗梥楤檧蓯锶餸"};
const unsigned char PY_mb_sou[]=  {"搜艘叟馊嗖嗽薮廋擞溲螋飕瞍嗾捜蒐锼醙藪籔櫢擻餿欶鄋獀鎪颾颼騪傁凁叜廀捒摗撨敕族棷涑潚瘶蓃謏鏉"};
const unsigned char PY_mb_su[]=  {"素苏速俗诉宿酥塑粟肃溯夙蘇窣愫愬稣谡僳涑簌甦嗉蔌訴缩肅傃觫粛棴憟摵嫊遡餗樕蹜縤囌穌鋉驌玊洬膆謖泝蘓櫯藗鷫榡鱐僁卹嗖圱圲埣塐捽搬梀樎橚殐溸潚潥珟璛碿稡稤縮莤趚遬骕鯂鹔"};
const unsigned char PY_mb_suan[]=  {"算酸蒜狻匴筭痠撰祘笇篹选選"};
const unsigned char PY_mb_sui[]=  {"岁随虽遂碎穗隋髓绥夊睢雖隧祟隨歲邃燧眭鐩挼穂濉鏸尿谇誶荽綏歳脺繐倠繀砕粋賥瀡埣髄襚縗娞穟璲浽禭陏荾滖繸哸檖旞毸鐆亗嗺嬘嵗澻煫熣瓍睟簑粹缞膸芕莎葰蓑譢遀遗遺隊靃鞖韢"};
const unsigned char PY_mb_sun[]=  {"孙损笋隼荪榫孫飧損狲筍蓀潠喰蕵鎨搎槂猻薞巺扻摌树畃箰簨跣飱餐鶽"};
const unsigned char PY_mb_suo[]=  {"所锁索缩嗦唆莎梭琐娑蓑羧鎖惢嗍傞挲桫縮睃葰唢鮻嗩摍瑣鎍靃簑溹趖魦鎈縒莏逤簔些嫅岁嵗抄挱暛歲沙溑牺犧獻琑璅蜶衰褨逡鎻鏁霍髿"};
const unsigned char PY_mb_t[]=  {"他同它唐谭陶汤童涂田佟提题体图天头通条特土团统台她太套铁"};
const unsigned char PY_mb_ta[]=  {"他她它塔踏塌祂沓牠榻蹋铊挞獭闼褟溻遢遝趿鳎撻拓漯咜撘荅逹搨鉈誻鞳禢嚃嗒濌闥獺鰨澾鞈毾涾榙鎉鞜闒錔侤傝呾嚺墖太崉搭湿溚濕狧譶蹹躢达迏迖達鎑闟阘鞑韃鮙"};
const unsigned char PY_mb_tai[]=  {"太台泰抬胎态钛苔肽汰邰骀酞薹呔跆臺態鲐檯儓炱鈦擡咍鈶颱斄溙嬯坮燤箈籉鮐冭囼大夳奤孡忕忲旲枱漦炲珆粏能舦菭詒诒軚釐駘"};
const unsigned char PY_mb_tan[]=  {"谈弹探谭贪坛叹摊坦碳痰潭滩炭檀瘫毯昙钽談澹坍覃郯袒湠彈傝貪弾攤倓嘆譚壇惔潬憳怹忐歎醓僋锬灘癱菼曇儃壜癉醰罈譠撣嘾埮餤嗿繵賧藫貚裧黮憛鉭舕婒顃榃暺罎镡但啴嘽墰墵憻掸撢擹橝沈淡湛漢炎璮痑禪緂胆舑舔荨蕁蕈襢赕醈錟鷤"};
const unsigned char PY_mb_tang[]=  {"汤唐堂糖趟躺烫塘棠淌倘膛溏镗湯搪樘瑭欓傥耥螳铴蹚醣帑燙鎲羰爣螗儻钂蝪惝煻摥踼鏜簜愓榶赯鎕漟蘯矘漡攩逿橖戃嵣蓎閶磄闛鐋薚鶶曭闣鼞饧伖偒傏劏啺嘡坣弹扩擴禟篖糃糛膅荡蕩鄌鐺铛镋阊隚鞺餳餹饄黨"};
const unsigned char PY_mb_tao[]=  {"套逃陶涛讨桃淘掏韬滔夲绦焘洮丶萄饕弢討祹啕濤鼗綯匋韜慆嫍檮梼迯幍搯槄燾絛騊醄縚叨鋾鞀駣蜪錭仐咷夵姚抭挑涭瑫筹籌綢縧绸绹裪詜謟跳轁鞉鞱頫飸饀"};
const unsigned char PY_mb_te[]=  {"特忒忑慝铽貣蟘鋱匿式犆職脦蚮螣貸贷"};
const unsigned char PY_mb_tei[]=  {"忒"};
const unsigned char PY_mb_teng[]=  {"疼腾藤滕誊痋騰螣縢籐謄熥籘邆霯僜儯幐漛膯虅駦驣鰧鼟"};
const unsigned char PY_mb_ti[]=  {"提体题踢替梯剃蹄啼剔缇涕锑鍗屉體惕悌倜題扌鹈俶醍嚏厗逖绨崹偍洟薙褆殢軆荑稊渧惿躰詆緹徥珶悐啑綈裼迖籊騠鯷鶗徲姼趧蝭楴揥戻嵜鶙屜鵜鷤鬄瓋磃謕蕛褅銻鷈嗁嚔奃媂媞弚弟惖折挮掦擿是桋棣歒漽狄瑅睇碮禵穉罤肆苐虒蟬衹諦诋谛趯跃踶蹏躍达迏逷遆適錫鐟锡骵髢髰鬀鮧鮷鳀鴺鷉"};
const unsigned char PY_mb_tian[]=  {"天田填添甜舔恬钿忝阗畑殄腆掭倎畋畠湉佃搷屇悿晪甛緂沺舑婖菾琠窴鈿酟闐淟碵賟餂捵鴫磌痶顚靦鷆睼鷏兲典吞呑唺嗔塡娗寘栝沾滇瑱璳甸町畇盷睓瞋紾胋舚苫蚕蚺覥觍銛錪鍩鎭鎮铦锘镇靔靝顛颠黇"};
const unsigned char PY_mb_tiao[]=  {"条跳调挑眺苕條調庣迢蜩佻窕粜龆儵朓祧笤髫鲦脁宨岧誂蓨糶鞗鯈覜蓚嬥咷絩趒鰷鎥朷芀窱祒齠啁姚岹恌斢旫晀桃樤稠聎脩艞萔蓧螩超趠踔銚鋚铫頫"};
const unsigned char PY_mb_tie[]=  {"贴帖铁貼萜鐵餮鐡僣呫鋨怗鉆揲惵蛈鴩驖占聑蝶跕鉄銕锇飻"};
const unsigned char PY_mb_ting[]=  {"听挺停厅庭亭婷廷汀艇霆烃聽梃葶蜓町閮铤脡廳莛侹珽綎聴渟庁筳諪廰珵聤娗艼桯榳烴濎楟頲鋌嵉烶蝏鼮圢侱厛奠奵庍忊涏耓聼誔邒鞓颋"};
const unsigned char PY_mb_tong[]=  {"同通痛铜童桶统筒捅桐瞳彤佟酮砼潼仝恸侗嗵僮偅統炵峒茼垌銅曈粡樋烔囲浵橦哃痌湩朣詷慟爞絧犝衕膧氃鮦狪鉖蓪餇恫劏勭峂峝庝恿憅晍洞熥燑獞眮硐硧秱穜筩綂艟蚒蜼蟲赨重鉵鲖"};
const unsigned char PY_mb_tou[]=  {"头投偷透頭骰钭偸妵鍮蘣黈敨紏斢埱亠婾媮愉殕綉緰绣褕諭諳谕谙逗鋀飳"};
const unsigned char PY_mb_tu[]=  {"图土吐涂兔突徒凸途屠秃荼圖菟钍鍎塗堍図兎酴湥瑹莵禿捈瘏鋀腯葖稌蒤唋汢跿廜捸嵞駼涋梌峹鵚筡嶀鼵鵌鷵鶟釷鵵鷋余凃啚圗圡堗墿宊庩怢悇揬摕斁杜檡潳痜腞趃跌迌鈯鋵馟"};
const unsigned char PY_mb_tuan[]=  {"团湍鏄團疃抟彖団槫褖煓慱墥糰貒猯鷒鷻剬剸圕塼嫥專摶敦檲湪漙畽磚稅税篿蓴褍鱄鶉鹑"};
const unsigned char PY_mb_tui[]=  {"退推腿褪忒颓蜕煺俀騩頹魋蓷穨隤僓弚頽藬橔怢蹪駾侻啍墤娧尵弟稅税聉脫脮脱蘈蛻謉讉蹆追頺饋馈骽"};
const unsigned char PY_mb_tun[]=  {"吞屯臀囤豚氽暾饨呑褪焞魨庉坉畽軘蜳芚錪飩吨吴啍噋忳憞旽朜汭沌涒炖燉窀純纯肫膯臋豘逐霕鲀黗"};
const unsigned char PY_mb_tuo[]=  {"托拖脱拓陀妥坨驼驮砣沱唾佗庹乇铊脫橐椭箨鸵柁柝侂鼍魄跎酡蟺馱託鮀侻駝飥駄騨嘽嫷紽跅橢莌驒楕鼉沰鴕毤碢袉籜岮毻堶魠他仛咃啴媠它彵惰扡拕挩捝撱杔杝棁槖汑池涶牠狏砤磚稅税舃舄萚蘀蛇袘袥訑詑說説讬说踻軃迆迤迱鉈鋖阤陁隋饦馲駞驝鰖鱓鵎鼧"};
const unsigned char PY_mb_w[]=  {"为我无王汪卫魏吴韦闻乌邬翁温伍问外五位物委完温万文往武务围误晚"};
const unsigned char PY_mb_wa[]=  {"哇挖瓦娃蛙袜洼娲佤唲腽襪漥窪嗢窊窐媧韎韈瓲膃溛凹劸咓啘嗗姽屲帓徍搲攨汙汚污畖砙穵聉譁邷靺鞋韤鮭鲑黳鼃"};
const unsigned char PY_mb_wai[]=  {"外歪崴喎咼瀤呙夭竵顡"};
const unsigned char PY_mb_wan[]=  {"玩万完晚碗湾弯丸婉腕挽宛皖蔓绾顽烷夘椀剜琬萬菀卍脘纨蜿婠鍐惋莞畹晼笂潫彎灣晩掔綄豌芄関頑倇鄤汍翫琓槾刓澫綰紈薍捥輓綩岏杤鋄睕忨抏捖乛免关卐唍园埦塆壪夗妧娩孯帵惌朊梚涴盌箢絻脕苋莧莬萖蚖貦貫贃贎贯踠輐邜鋔鋺錽鎫闗關骩骪骫魭"};
const unsigned char PY_mb_wang[]=  {"网王往忘望汪旺亡妄枉罔網惘暀莣魍徃仼朢尪辋迋盳抂菵輞瀇尢亾兦匡尣尩尫彺徍忹朚棢焹琞皇蚟蛧蝄誷迬"};
const unsigned char PY_mb_wei[]=  {"为未位喂味微伟维威魏胃卫委唯围韦薇伪尾谓惟為危炜玮蔚纬慰畏苇违巍尉渭萎爲煨偎囗帷圩葳鍏痿桅帏潍猥娓謂隗偉洧闈寪圍嵬隈維逶衛暐鍡闱溦偽沩韪浘噲猬濊韋煟艉涠遗緯幃瑋梶诿崴違餵菋韡僞崣儰廆葦鲔撱蒍煒洈鮠頠湋壝痏軎蓶溈瞶霨蝟碨諉衞趡濰蘶癓蔿鮇徫鮪餧霺峗媦藯喡縅芛磑詴椲犚鄬鏏峞渨蝛蜲踓蜼讆磈愄覹覣褽癐巋潿瀢犩躗椳鰄韙骫罻濻烓揋斖瓗隇饖腲葨亹倭厃叞哙唩喴堤墛媁媙岿嵔嶶恑愇懀捤捼揻撝有机楲欈沇潙煀熨熭燰猗猚琟璏眭硊硙立緭芟苿茟荱荽萏薳蜹螱觹觽觿讏踒躛轊遺醀錗阢隹韑颹骩骪鰃鰖鳂鳚"};
const unsigned char PY_mb_wen[]=  {"问文温稳闻吻纹雯蚊搵汶瘟問刎亠玟閺芠蕴炆聞紊溫閿紋穩璺脕阌闅妏顐瑥穏鰛呡絻馼忞呅塭魰殟豱抆歾桽鰮饂榲鳼鼤免呚娩彣忟愠慍揾昧昷榅殁渂煴珳瘒眼砇笏緼縕缊肳脗莬蕰薀藴蘊蚉螡蟁褞輼轀辒鈫鎾闦限韞韫鳁鴍鴖"};
const unsigned char PY_mb_weng[]=  {"翁瓮嗡滃蓊甕蕹聬奣螉齆暡罋鶲瞈塕勜壅嵡蒙鎓鹟"};
const unsigned char PY_mb_wo[]=  {"我喔窝握卧沃硪涡倭渥蜗肟斡偓幄臥挝龌堝窩濄莴仴涴瓁渦雘擭踠踒齷腛蝸萵猧焥撾婑濣捼瞃婐捰薶唩嗌噁嚄埚夭媉媪媼捾杌枂楃涹瘟矆臒艧蒦馧龏"};
const unsigned char PY_mb_wu[]=  {"无五唔吴物吾舞武屋误乌雾勿伍务午悟捂巫污呜毋戊邬無钨兀坞晤梧芜吳诬摀侮忤妩婺鹜蜈仵骛屼庑寤焐於怃洖圬誤堥浯痦烏鼯芴霧務憮鋈嗚阢洿倵蕪橆汙誣潕譕珷杌禑沕亡鹉俉迕靰嫵呉粅躌牾鄔塢啎廡旿墲剭嵨郚騖膴莁霿玝扤幠碔蘁窏鎢杇鷡瞴趶鯃岉雺恶甒鵡逜茣螐錻珸鵐鶩矹鋘釫鴮齀乄亾仡伆侉儛兦喔噁垭埡奦娒娪娬峿嵍弙御忢悞悮惡扜扝揾敄旄杅柮歍母汚渞渥溩熃熓瑦璑瞀祦窹笏箼莫蝥蟱誈鋙铻陚隖霚鰞鹀鼿齬龉"};
const unsigned char PY_mb_x[]=  {"学下行许徐邢萧肖薛熊解项习冼小线性新些想心向相系席现西修象先形"};
const unsigned char PY_mb_xi[]=  {"系西洗戏喜係细吸希溪锡息兮熙席惜稀习夕袭曦昔悉膝析奚玺硒隙熄腊嘻禧烯汐栖犀嬉徙羲熹茜晰匸铣浠戲媳鎴矽細皙僖晞郗莃醯蜥窸觋莔淅唏檄翕牺舄豨橀繫熺屣悕蹊錫粞隰呬葸襲欷戯饩習郤螅蟋煕舾傒槢晳阋禊穸鑴樨菥歙瓕谿扱裼蓰卌瘜憙璽巂鸂鼷俙礂犠氥愾忥纚嶲盻碏潟枲惁蠵諰觿狶戱肸徯潝犧憘燨赩縰巇謵蓆虩睎郋嶍覡霫綌鬩銑鱚鈒蟢覤鄎咥摡焟恓暿凞酅徆譆渓鯑雟熂獡蹝餼貕釳鰓琋爔豯鰼恄飁廗蔇驨蒠黖蝷騱怬螇鵗釸葈闟衋榽蜤騽蕮桸緆屖欯鼳鼰橲漇囍义卥卻厀吚呰咦咭唽噏嚊嚱塈壐奊娭媐嬆宩屃屎屭嵠忔忚怸慀扸撕擊既杫棲椞椺欪歖氣洒湿滊漝澙濕灑焁焈焬熈熻燍犔猎獻瞦矖磶稧糦縘繥绤羛義翖肹胁脅脇脋舃蒵薂蜴褶覀觹觽訢詑誒謑謚诶谥豀赥趇趘躧遟郄釐鈢鉨鉩錯鏭钑错隟隵雭霼餏餙饻鳃鳛"};
const unsigned char PY_mb_xia[]=  {"下夏吓瞎虾霞侠峡厦辖匣狭暇呷遐瑕狎昰芐梺蝦鍜嚇黠罅俠祫硖柙唬珨狹峽徦圷轄廈煆舺諕烚鰕謑笚蕸浹欱陜硤螛谺縖赮魻鶷舝鏬閜碬颬騢瘕丅假傄叚呀哧嗄嗑埉夓夾岈懗押捾搳敮歃毳浃溊炠疜疨睱磍筪給縀给翈葭郃鎋閕陿"};
const unsigned char PY_mb_xian[]=  {"先线县现咁闲仙显嫌贤限鲜险咸弦献陷宪馅掀腺衔娴见纤羡冼酰涎舷祆線現藓痫霰蚬籼岘賢苋癎铣縣閒暹锨憪顯険憲粯県鍌嫻跣跹閑獻蚿氙險鮮彡鹹鹇睍佡獮憸纖莶綫顕伭洗筅僩綅俔絃仚尠禒晛羨燹銜諴堿娊餡僊慳灦玁僴幰秈啣忺繊銛禰姺孅誸溓鏾猃蜆譀尟姭珗涀廯嫺筧壏韱峴豏蘚盷赻鶱譣撊獫陥鰔奾襳釤槏澖褼胘杴纎錎莧蘞埳顈攕羬躚癇蛝瀗屳馦鋧闞嘕櫶毨贒韅娹糮搟攇鷴烍鷳鼸伣僲咞哯唌嗛垷妗妶姍姗娨婱嬐寰崄嶮慊懢挦捍探揱搚撏枮梘橌欦洒湺濂灑狝玹甉省瞯矣硍碱礆礥稴笕箲絤綖縿缐肩胁脅脇脋膁臔臤臽苮蔹薟藖蘝衘見誢蹮軐軒輱轩醎醶銑錟鍁鑦钐铦锬阚韯饀鱻鷼麙麲黹"};
const unsigned char PY_mb_xiang[]=  {"想向像象相香项乡箱响祥湘翔巷享详镶厢襄橡飨饷缃骧降芗庠鄉葙響項儴鲞瓨闀欀詳鑲蟓嚮姠珦郷瓖緗餉蠁饗啌廂萫襐纕驤曏鐌薌銗閧衖鄕膷饟忀鬨鱌晑鱶缿鯗亨亯佭傢勨勷啍嶑攘栙楿洋潒絴羏舡蘘蚃跭迒鄊銄鋞闂鮝鱜鴹麘"};
const unsigned char PY_mb_xiao[]=  {"小笑晓肖校萧消孝销效啸筱削箫霄潇宵硝枭逍骁嚣绡哮哓傚咲曉蕭庨魈淆篠笹虓簫崤嘯蛸箾暁銷猇潚皛枵効洨啋呺毊橚睄綃譊瀟憢嘐鴞囂梟骹詨灱翛漻謼斅嘵縿窙謏恔恷嗃穘膮莦萷謞獢轇歊燆涍痟藃髇蟂郩虈蠨熽髐驍踃薂揱痚鷍佼侾俏俲叜叟号呼咻哨唠唬嘋嘨嘮嚻姣婋宯彇挠捎搜撓撨敩斆梢櫹歒歗殽滧澩灲烋焇熇燺爻狡獟皢硣筿簘絞绞胶脩芍茭蟏蟰訤誟誵較较颵騷驕骄骚鴵鵁鷕鸮"};
const unsigned char PY_mb_xie[]=  {"写些谢鞋邪斜携协蟹歇泻血卸泄屑挟蝎胁谐械偕燮懈榭寫楔褉撷謝亵冩缬契解邂勰绁拹鮭纈躞獬廨薤瀉攜偰協瀣挾絜渫伳緳劦蠍脅澥愶滊瑎叶諧榍颉媟屧脇繲卨嶰揳僁灺屭褻觧躠擷襭熁觟垥恊猲蠏祄魼奊薢裌屓齛慀燲吤嗋蝢孈韰齥龤搚焎齘齂偞儶唏喈噧塮夑夾娎屜屟峫徢接摺擕旪暬枻桔榝槷欸歙殺汁洩湝溃溉潰炧炨烲爕眭碿禼糏紲絏絬綊緤缷翓耶脋膎藛蝑衺諜譮讗谍豫跬迦鍱鐷隰鞢鞵頁頡页骱鬹鲑"};
const unsigned char PY_mb_xin[]=  {"新心信欣馨鑫辛芯锌薪昕歆忻莘忄衅鈊鐔伈囟炘潃噺杺镡枔鋅撢焮舋寻馫廞惞庍盺釁妡橝鬵愖礥阠伩俽兴噷姰嬜孞尋憖欵款歀脪興襑訢訫軐邤顖馸"};
const unsigned char PY_mb_xing[]=  {"行性型星姓醒兴形幸刑邢杏腥荇惺猩煋硎擤興侀省饧倖洐悻陉荥垶婞狌陘涬哘瑆騂巠鈃鉶坙鋞娙裄莕箵餳觲蛵坓塂嫈嬹曐滎熒皨睲研硏篂緈胜臖觪謃郉銒钘铏骍鮏鯹"};
const unsigned char PY_mb_xiong[]=  {"熊兄雄胸凶匈夐芎汹兇敻洶詗赨恟忷哅宪昫焸胷訩詾讻诇賯"};
const unsigned char PY_mb_xiu[]=  {"修秀休绣袖羞嗅锈溴宿朽岫咻琇脩脙貅綉庥馐繡髹珛繍鸺茠鏽嚊臭滫烋銝櫹鏥鎀樇苬臹螑鵂饈鮴糔俢烌煦璓綇臰莠蓨裦褎褏銹鏅飍髤鱃齅"};
const unsigned char PY_mb_xu[]=  {"需须徐许虚续旭序恤嘘叙蓄绪絮胥墟煦戌婿吁圩栩須許畜勖诩顼盱虛呴續緒酗繻歔浒蓿敘訏続垿溆敍銊醑侐噓姁勗湑糈鬚砉洫掝慉諝欻謳卹魆嬃冔詡昫旴聟珝暊諿喣壻緰鑐蕦幁魖楈稰縃漵頊殈訹蚼胊鄦欨蓲驉窢緖藚蝑烅揟晇烼沀瞁于亐伃休伵余俆偦呕呼咻嗅嘔嘼妶姐媭怴怵恓惐旮朂朐槒欰歘汿淢滀滸潊獝珬疞盢盨眗瞲矞稸籲肷芋芌芧蒣藇虗蛡規规謣譃讴谞賉邪鉥雩馘魣鱮"};
const unsigned char PY_mb_xuan[]=  {"选玄轩宣悬旋炫萱璇喧眩癣绚铉暄煊漩瑄選渲泫烜煖儇楦谖軒鏇券玹禤懸县妶镟翾揎碹璿絢狟袨痃縼衒鉉蠉鞙諼鋗晅鐶癬嫙昡諠懁琄琁媗獧昍咺讂蜁揈蓒蝖贙轋愋駽鍹矎萲蔙愃亘吅喛塇夐姰嬛弲怰撰擐暅暖暶梋楥檈洵涓澴玆瓊盤眴睻箮絃絹縣繏绢翧蕿藼蘐蜎譞還镮颴饌馔駨鰚"};
const unsigned char PY_mb_xue[]=  {"学血雪薛穴靴削彐學谑鳕踅噱趐泶壆吷泬謔轌鱈膤樰觷怴岤泧澩鷽梋嶨袕艝斈燢疶蒆瞲狘乴决勪哮嚯坹峃桖決滈瀥炔烕疦茓辥雤鞾韡鸴"};
const unsigned char PY_mb_xun[]=  {"寻讯训熏薰勋巡逊循迅旬询荀巽驯汛洵浚殉浔徇埙蕈鲟珣恂尋訓醺曛訊勳濬窨峋遜獯潯詢勲侚燂薫郇纁荨噀蟳葷噚眴勛馴鄩灥塤焄璕攳紃壎栒撏矄揗鱘燻襑咰愻蔒燖燅迿臐荤伨偱卂嚑坃壦奞姰孙孫廵悛杊桪梭樳殾毥洒潭煇爋爓狥狻稄筍筼篔絢绚蕁蘍蟫訙賐逡遁鑂鑫顨駨鱏鶽"};
const unsigned char PY_mb_y[]=    {"一有杨严余阎姚颜袁燕俞岳恽乐叶羊尹尤用要以于也样义与由压员月意又运原油验"};
const unsigned char PY_mb_ya[]=  {"呀丫压亚牙雅押鸭芽娅崖哑涯吖鸦圧劜伢衙轧蚜亞垭氩桠讶崕氬亜壓掗琊痖啞鴨玡睚砑厓鐚迓岈猰犽揠埡呾椏婭疋鴉蕥訝姶齾堐輅唖庌錏厊襾圔輵穵磍孲圠聐齖乛俹倻厌厭吾堊庘御拁挜札枒椻歇浥漄潝烏猚瑘疨瘂碣稏窫笌軋辂邪釾铔閘闸顔颜鵪鵶鶕鹌鼼"};
const unsigned char PY_mb_yan[]=  {"眼烟演言严燕盐岩沿颜炎艳研延妍彦雁验焉阎咽宴闫掩厌焰晏嫣淹衍砚焱堰檐阉琰鄢円筵腌偃煙恹谚蜒滟閻奄魇俨閹谳湮酽郾胭阏晻顏芫厣兖鹽赝嬿挻饜嬮顔彥嚴験硏崦偐唁剡餍豔縯菸讠偣厭驗兗弇鼹艷罨龑菴綖巖艶塩褗喦硯铅洝嚥椼甗醃諺姸儼巘灩巌椻嵃顩揜醼埏簷厴讞厳沇鷃讌棪臙殷鴳娮碞鴈唌豜燄郔匽魘媕黶渰扊喭溎嵒嶮挩閆蝘贗釅淊漹裺湺鰋嵓焔珚壛揅牪鷰烻黭阽錟薟橪觾贋猒莚抁爓噞嬐篶酀敥齴虤驠鳱壧礹曮隒軅黫樮楌萒鶠黤騴齞孍躽狿鼴姲愝麙鳫鬳鼽乵但俺傿剦厂厃囐埯墕夏夵妟娫嬊屵崄嶖巗巚巡广庵廵懕戭捝掞揞昖暥曕檿櫩欕殗氤洇涎淡淫渷灎灔灧炏熖狠琂瓛硽羡羨膁莶葊葕蔅蔫覃覎觃訁訮詽豓豣趼这這遃酓醶鉛锬閼阭险陰隁險靥靨顑騐麣麲黡黬黰齗龂"};
const unsigned char PY_mb_yang[]=  {"样杨养阳羊洋扬痒氧央仰漾秧佯殃恙楊炀鞅樣泱鍚養陽様疡徉垟鸯炴揚烊蛘暘怏卬佒癢崵潒昜敭羕瑒姎鍈崸坱颺瀁瘍煬眻婸鴦珜鸉抰歍軮雵禓岟懩紻胦鐊攁鉠傟劷勜咉奍將慃旸昂映柍楧氜氱湯眏礢羏羘羪英詇詳諹详輰钖阦霙霷飏飬駚鰑鴹"};
const unsigned char PY_mb_yao[]=  {"要药咬腰姚妖摇耀邀尧遥瑶窑幺曜爻谣舀夭钥吆杳肴垚鹞侥藥傜鳐窈葽鑰喓徭繇偠愮猺崾搖媱薬珧遙窅瑤殽堯岆鴢疟謠祅么葯燿窯铫颻轺揺獟騕訞尭抭榣窔謡约嶢詏窰殀榚撽蕘靿曣顤摿噛嗂銚艞陶恌穾玅覞鰩溔驁軺鷂鷕眑苭烑袎筄宎餚柼乐仸倄僥匋啮嚙娆婹嬈峣嶤幼徺怮暚枖楆樂洮淫滛瀹烄熎狕猶由矅磘箹約纅荛蓔蘨讑趯踰鎐闄隃飖餆骜鴁鼼齩"};
const unsigned char PY_mb_ye[]=  {"也页叶业夜野耶液爷冶椰烨晔噎曳掖咽谒葉腋邺靥揶業頁爺铘邪熀鄴暍倻堨枒謁緤埜瓛拽燁殗靨澲殕窫痷嶪鍱楪曄鎑擫鵺瞱蠮擛漜鐷饁抴歋擨亪亱偞僷吔啘喝嘢嚈墅墷壄射峫嶫懕捓捙揞揲擖擪斜曅曗枼枽洂洇涂潱煠爗皣瞸礏聂聶荼虵蠱鄓釶釾鋣鎁餘餣饐馀馌驜鸈黦"};
const unsigned char PY_mb_yi[]=  {"一以已亿易亦伊意依衣义宜仪乙益医矣逸异艺翼译移怡尾壹疑毅忆倚议姨咦遗夷奕溢抑颐椅裔役邑蚁懿驿谊弋轶贻翊漪疫彝胰弈沂乂佚揖辷弌屹羿咿诣潩翌熠翳義绎刈诒苡镱噫挹臆薏埸晹誒嶷迤槸猗圯铱艾悒缢儀譯怿饴镒旖呓燚億異钇峄瘗憶殪熼佾藝蟻醫荑遺鎰劓侇痍寲洩浥顗舣議褘黟癔肄拸墿蜴訳扆斁瀷衪俋駅誃儗詣钀偯彛貽泆勩誼頤崺繄枻眙佁簃錡齮彜埶廙裛昳鉯曵亄仡匜伿栘垼銥枍敼驛苅帟袘酏靉踦曀謚洢訑觺詒壱繹鶂嫕釔帠暆軼輗杙釶蓺扡歖劮禕宧畩懌鷁箷詑柂椸螘繶黓瑿豷殔寱紲毉珆浂絏迻飴嫛靾譺詍縊跇醷囈熈圛瘞峓謻掜狋鮨貤槷熤戺蘙澺檹蛜沶銕阣恞螔燱羛嗌檥檍瘱藙賹搤冝鏔蛦襼欥衵迆醳蛇桋膉郼轙唈匇羠嶧釴隿鐿萓艗鸃肊霬鯣鷾鷖贀跠艤焲芅饐媐耴礒鳦耛瓵玴黳陭顊嶬鷊稦熪齸燡欹丿乁也伇佗兿勚印叆叕台叹吚听呭呹噎圪坄坨夁夕失奇妷姬嬄嬑嬟孴它宐射崎巳巸幆庡弬彞彵忔怈怠悘悥扅择掎搋撎擇攺敡施旑曎杝栧栺棭椬榏樴櫂欭歝殹汽治泄洫浳渫湙澤炈焉焬焱熙犄狏獈疙痬睪瞖硪礙祎秇穓竩笖籎維綺绁绮维羡羨苢萟虉蛡蛾螠衤袂袆袣裿褹襗訲譩讉讛诶谥豙豛貖輢辥迭迱逘释釋鈘鈠鉇鉈铊锜阤陁隶雉霅頉頥食骮鮧鴺鶃鶍鷧鹝鹢鹥黝"};
const unsigned char PY_mb_yin[]=  {"因引银音印阴饮尹隐淫殷吟瘾胤茵荫寅廴垠铟龈姻洇蚓銀湚陰飲喑霪夂鄞訢愔隱氤茚垔窨伒噾吲堙崟狺蔭禋湮犾絪夤闉廕癮裀諲垽瘖粌誾婬釿傿靷隠嚚殥堷憖飮檃凐鈏韾銦圁蟫梀荶讔駰硍蘟鷣螾檭霒苂酳朄酓歅霠蔩趛猌濦輑欭慇齗蒑烎齦圻乑乚众侌冘听唫噖囙垦壹婣峾崯嶾币慭憗懚斦栶檼櫽欽沂泿洕浔淾溵滛潭潯濥烟玪珢璌癊碒磤秵筃緸縯芩言訔訚訡赺鈝闇阥陻隂鞇骃鮣龂"};
const unsigned char PY_mb_ying[]=  {"应赢英硬影营迎鹰盈颖映莹樱瑛婴蝇莺瀛夃滢缨萦嬴萤郢颍應荧楹璎膺茔瘿贏瑩蓥罂鹦潆穎櫻嘤營撄媵桜鷹柍渶嬰荥応灐俓蠅偀営瀯螢纓縈鶯煐暎瓔縄霙潁瀅嫈滎摬韺罃熒褮譻攖塋覮籯蛍謍濴瀴蝿頴鎣碤礯蝧瀠旲甖廮濚癭珱蠳攍鴬韹嚶蘡賏朠罌藀鱦甇巆梬鸚軈矨鶧僌哽啨噟央媖孆孾嵤巊愥攚景桯櫿泂浧溁溋濙灜焸甸盁眏籝緓繩绬绳耺膡莖萾譍逞鐛鑍锳鞕颕鷪鸎"};
const unsigned char PY_mb_yo[]=  {"哟唷喲嚛"};
const unsigned char PY_mb_yong[]=  {"用永勇拥涌咏泳雍庸蛹佣甬俑慵镛壅痈邕噰墉灉詠踊傛鳙埇饔槦湧臃恿擁傭怺鏞喁澭筩鄘踴雝嗈癰揘廱禜愑鷛嫞醟慂滽嵱塎悀鰫郺鯒勈容彮惥愹柡栐牅癕砽硧臾苚蒏蕹遇銿顒颙鱅鲬"};
const unsigned char PY_mb_you[]=  {"有又由油游友右优幽尤忧幼犹邮佑悠呦诱铀釉酉疣柚冘攸囿鼬尢侑祐猷宥瀀莜蚴铕遊優卣牖黝鱿猶莠斿憂莸蚰繇誘偤褎羑姷櫌懮纋狖銪峟蝤楢郵沋戭輶蝣槱泑苃迶麀訧庮銹蚘怮耰莤牰逌嚘怞浟秞鄾貁肬獶魷蕕蒏揂聈丣亴叹哊唀坳奥妋孧尣峳怣扰揄栯梄梎櫾汓汼泅泈湵滺牗甴痏禉糿羐羗聱脜脩蜏褏輏逰邎酭鈾锈駀鮋鲉"};
const unsigned char PY_mb_yu[]=  {"与于鱼雨玉欲余语宇遇羽域愈预浴予於與御育逾渝喻郁裕瑜俞虞愚禹渔豫淤娱钰誉狱毓寓煜峪馀榆昱瘀屿隅亐舆妤芋吁谕愉聿驭魚彧盂熨鹆迂欤庾腴語阈禺瑀萸谀顒鬻楀嵛牏觎鹬湡竽餘纡圉妪閾俣雩箊鈺娛踰畬悆棜狳燠嵎慾繘閼龉圄堣矞堉揄遹饫噳窳臾舁褕瘐尉偊譽預漁悇唹貐鬱伃諭輿窬蜮燏俁獄蝓潏棫伛淯敔祤禦瘉崳僪嶼儥邘傴堬蔚癒貍馭魊薁萭寙丿喁紆谷娯歟兪杅蓣媮籲玗栯諛謣釪旟灪醧扜喩陓楡礇衧袬歈挧嫗爩隃隩齵戫鴥麌錥砡峿澦鱊汚藇鱮穻璵覦鸆蝺鋙轝鸒罭荢翑淢緎盓睮蕍獝蕷鋊蟈艅欝稢鵒鷸菸羭蘛澞鄅燰硢蓹歶蘌噊蒮貗鰅篽齬礜頨籅螸斞輍飫畭鯲鳿驈楰鴪鮽桙雓斔礖饇軉稶粥菀丂亏俼匬叞吳吾唷喅喐噢圫墺夕奥娪婾媀嬩宛崛嶎庽忬惌惐懊懙或扵拗捓昙栩梧棛櫲欎汙污汩滪澚澳灹焴煨王玙琙琟痏秗穥籞腧舒芌苑茟茰萮虶蜍蜟衘衙迃逳郚酑銉鍝鐍鐭铻阏霱颙騟骬髃鬰魣鴧鷠"};
const unsigned char PY_mb_yuan[]=  {"元远原源员园院愿圆袁缘苑怨媛冤渊援猿垣沅鸢鸳塬遠辕緣願瑗爰垸鼋圓園芫掾員圜橼棩淵嫄噮螈褑妴箢妧鎱眢薳惌縁媴湲悁蒝蚖杬蜎鵷灁轅渕駌寃謜鳶笎櫞輐夗薗鴛裷楥羱禐蝯騵葾鋺獂蝝肙嬽邍鼘黿榞蒬溒裫榬鶢邧傆允剈厡厵咽喛囦圎嫚宛弲捐涓涴渁渆焆猨盶穿蜵衏褤貟贠逺酛鈨阮陨隕魭鶰鹓鼝"};
const unsigned char PY_mb_yue[]=  {"月越约曰岳悦粤跃阅乐说玥栎钺約瀹説樾哕閲龠刖閱悅钥箹粵籥躍鈅噦嶽趯軏鉞櫟爚蛻戉扚擽鸑臒鋭鑠蚎矱礿躒蘥焆禴鸙黦抈髺龥哾囝块妁妜嬳岄彟彠恱捳曱枂汋烁爍矆篗籆籰药蚏蜕蠖說跀跞銳铄锐"};
const unsigned char PY_mb_yun[]=  {"晕云运韵芸孕允匀蕴昀雲耘筠陨熨韫愠恽殒酝枟運郧媼氲鋆賱韻暈郓伝纭氳贇煇勻沄蘊褞澐狁涒緷醞殞餫頵紜妘蕓慍隕繧薀篔玧韞轀縕熅奫鄆馻畇惲荺抎橒鄖熉馧蜵溳眃蝹鈗霣縜阭员齫韗傊叞呍員喗囩均夽媪尉尹怨愪抣榅樂涢温煴煾瘟盾磒秐筍筼緼缊耺腪苑菀蒀蒕蒷蕰藴貟贠赟輼辒醖齳"};
const unsigned char PY_mb_z[]=   {"在这主中张章赵曾郑周邹朱种着祝甄庄宗詹臧祖左展争战作正之制重组治只子自质指"};
const unsigned char PY_mb_za[]=  {"咋砸杂匝扎咂雜拶雑噈磼鉔雥襍咱啈啐喒嘁囃囋囐帀桚沞沯濽灒籴紥紮臜臢韴魳"};
const unsigned char PY_mb_zai[]=  {"在再载仔宰哉栽灾崽甾載災賳渽傤儎才扗洅溨烖睵縡菑酨"};
const unsigned char PY_mb_zan[]=  {"咱赞暂攒讚簪瓒昝錾趱偺贊暫瓚儹拶灒喒鐕糌讃賛鏨蹔囋噆臢寁禶饡酇儧兂揝撍攢桚涔湔濺濽瓉穳篸簮襸趲鄼酂鏩鐟"};
const unsigned char PY_mb_zang[]=  {"脏藏葬臧赃髒蔵驵奘牂臟臓賍贓弉锗匨塟戕牫羘賘贜銺駔驡"};
const unsigned char PY_mb_zao[]=  {"早造遭澡糟燥灶枣藻噪皂凿躁棗蚤唣慥皁璪璅繅傮煰梍譟竈簉繰蹧喿趮竃缲唕栆槽窖缫艁草薻謲醩鑿"};
const unsigned char PY_mb_ze[]=  {"则泽责择則仄啧沢澤咋赜帻崱昃幘厠擇責舴箦迮伬侧択蘀謮嘖賾樍稄庂襗捑滜鸅蠌笮側厕唶啫夨嫧廁措昗柞歵汄泎溭灂皟睪瞔矠礋稷簀耫萚葃蔶諎謫讁谪飵齚齰"};
const unsigned char PY_mb_zei[]=  {"贼賊蠈鯽鰂鱡鲗鲫"};
const unsigned char PY_mb_zen[]=  {"怎谮譖譛囎僭撍"};
const unsigned char PY_mb_zeng[]=  {"曾增赠憎综甑増缯贈罾锃繒曽鄫磳縡璔矰橧熷綜譄鋥鬷鱛"};
const unsigned char PY_mb_zh[]=  {"扎炸摘债战展长张章钟着照找这真争正政之制治只中周州主住抓转专撰赚装状准"};
const unsigned char PY_mb_zha[]=  {"炸扎渣闸乍眨札诈榨咋轧喳吒铡揸鍘醡查柞咤搾栅楂砟紮痄蚱偞哳齄囃霅劄剳軋詐喥皻挓喋箚蜡奓煠閘潳揷扠鮓觰鰈溠譗苲挿鞢抯蚻蔖譇樝齟齇齰偧冊册厏哆宱怍拃插搩摣擖柤柵渫灹牐甴皶笮箑紥耫膪苴蕏藸諎謯踷蹅迊鮺鲊鲝鲽龃"};
const unsigned char PY_mb_zhai[]=  {"摘宅窄债斋寨翟砦齋哜择債斎瘵侧嚌駘捚檡骴厏粂簀鉙亝側厇啇夈度抧擇擿柴榸牴疵祭箦膪責责骀"};
const unsigned char PY_mb_zhan[]=  {"站占战展斩沾詹粘蘸盏湛栈瞻毡绽颤戦辗戰佔旃崭霑邅谵斬惉栴嵁嶄偡棧鳽搌盞氈詀綻跕輾欃饘鱣颭嫸桟薝襢譫譧蛅橏魙輚黵轏琖虥驏醆驙餰鸇亶噡嶃嶘嶦怗拃旜椾榐氊湔澶皽碊菚虦袒覱謙讝谦趈蹍躔醮閚飐飦骣鳣鹯點"};
const unsigned char PY_mb_zhang[]=  {"张涨长章帐掌账杖仗胀丈障彰璋樟漳張嶂瘴蟑幛獐鄣漲帳仉粻暲脹賬嫜傽扙鞝粀慞墇鱆騿弡瞕遧仧幥承涱痮瘬礃蔁鏱鐣長镸餦麞"};
const unsigned char PY_mb_zhao[]=  {"找照赵招着兆朝昭罩召诏肇钊沼棹爪趙櫂曌炤鍣垗箌詔啁笊皽妱旐釗鉊盄嘲瑵鮡釽狣菬駋鳭佋啅巶晁枛桃淖濯燳爫瞾窼罀羄肁肈著蚤謿鼂鼌"};
const unsigned char PY_mb_zhe[]=  {"这着者折哲遮浙這喆辙褶蔗辄乇蛰锗蜇谪赭柘摺棏磔摂螫晢悊輒粍夂嫬鹧淛鍺謫轍蟄囁蟅謺輙鷓虴砓讋鮿聑馲矺仛厇啠嗫嗻嘀嚞埑堵庶慹扸摄攝斥慴晣杔樀樜歽潪籷耷聂聶袩褚襵詟謶讁軼轶適銸陬驝鷙鸷"};
const unsigned char PY_mb_zhen[]=  {"真镇针阵震振珍枕帧朕贞甄臻诊祯桢疹禛斟侦圳榛赈箴鍖眞砧鎮轸陣鸩缜潧蓁胗樼浈針姫貞稹偵鎭瑧畛診椹禎獉瑱紾楨袗侲沴縝謓槇眕挋軫溱紖誫枮眹碪塡桭鍼賑絼揕敶鴆籈鬒葴珎轃寊遉鱵栚澵榐薽辴鈂竧裖駗朾靕抮縥蜄黰唇坫塦填嫃屒帪弫慎戡搸敒昣栕殝沵湞滇纼聄萙蒖覙趁趂迧酖酙鉁鋴錱陳鮝鲞黮鼎鼑"};
const unsigned char PY_mb_zheng[]=  {"正整证郑挣争症征政蒸睁铮筝怔峥凧拯诤鄭湞證爭氶钲証狰晸綪烝倀崝癥掙姃崢幀睜箏丁鮏媜埥鉦諍鯖炡撜錚篜眐糽脀浧聇猙埩塣掟徵鲭丞伥佂嶒徎徰徴愸憕承抍揁敞止町瞠趟踭鬇鯹鴊"};
const unsigned char PY_mb_zhi[]=  {"之只至值指知直制纸治志支致智质置止枝汁职芝执植脂织痣滞芷掷酯址旨肢趾痔稚隻炙吱侄徵挚秩栀殖雉祗郅峙帋跖窒祉戠枳帜彘潪庢豸媞陟紙咫桎栉卮帙蛭贽挃忮摭誌執質織製厔亊胝骘職鉄値柣蜘鸷庤轵絷觯剬畤薙凪衹黹沚乿摯姪膣滯埴寘夛踯徴擲樀阯禔迣踬扺傂瘈紩偫謢稙臸軽滍歭氏觝椥擿鋕秖秷臷廌蚔軹緻轾礩貭幟栺恉銍櫍鳷淽櫛酈慹犆摨泜穉袟跱捗蹛瓡觶晊躓楖胵贄縶疻騺巵嚔鴙鑕识秪洷阤梔汥胑擳杝猘懥墆樲搘鷙懫螲隲狾樴瓆蘵騭扻鶨榰坁藢嬂蟙翐輊瀄衼躑汦蹢銴膱駤馽祑覟釞疐伎俧倁儨劕劧咥坧垁埃墌夂多妷娡实實崻徏徔徝恃憄抧抵拓拞搱摕斦旘昵杫栽梽槜氐洔漐潌熫疷眰砋示祁祇祬禃禵秇秓积秲稺筫絺綕耆聀芖茋茝菭虒袠襧觗訨識豑豒踶蹠軄迟遟遲郦铁铚锧陁馶驇鯯鳩鴲鸠鼅"};
const unsigned char PY_mb_zhong[]=  {"中种重钟仲众忠终肿冢衷盅锺種踵終眾塚夂鐘鍾柊伀煄衆螽腫狆尰舯緟蔠穜祌螤彸迚衶籦鈆妐忪蝩堹炂鼨乑偅刣喠妕媑幒徸歱汷泈潼瘇童筗舂茽董蚛蚣蟲衳褈諥蹱鈡銿鴤"};
const unsigned char PY_mb_zhou[]=  {"周州粥洲轴舟咒皱肘昼骤宙洀绉纣胄诌帚週酎妯晝籀軸皺碡繇呪紬侜冑甃啁僽盩喌鈾驟紂箒薵詶縐荮淍椆胕咮謅譸睭翢輈賙婤珘輖鯞銂騆菷徟鵃駎駲伷侏倜啄喙噣嚋府扭掫晭柚注炿烐疛矪祝籒籕粙舳葤詋調諏诪诹调赒辀逐郮铀霌騶驺鬻鸼"};
const unsigned char PY_mb_zhu[]=  {"住猪主朱祝著煮注竹驻珠助诸柱逐株筑铸烛诛贮渚竺洙嘱蛛拄豬蛀箸伫諸铢潴茱侏瞩苎炷邾翥杼褚註瘃駐躅硃麈紸佇紵丶笁燭瀦槠术钃疰橥舳築囑誅矚鑄蠋櫧殶属柷貯銖鉒欘窋劯軴灟櫫袾芧砫藸斸墸祩鸀跓篴跙鋳陼尌莇蠾磩藷蓫茿孎蠩跦竚罜嵀鴸馵羜眝蝫泏樦篫鱁絑鮢壴麆予劅劚咮嗻噣坾宁宔屬庶搊敱斀斗曯朝枓柠楮櫡泞澍濐炢煑爥秼笜筯纻苧茁蕏薥蚰詝迬逗逫鉏阻除霔飳駯騶驺鯺鼄"};
const unsigned char PY_mb_zhua[]=  {"抓爪挝簻檛膼髽摣撾"};
const unsigned char PY_mb_zhuai[]=  {"拽跩捙嘬尵睉顡"};
const unsigned char PY_mb_zhuan[]=  {"转赚专砖传撰篆轉馔賺啭專颛顓簨専転磚耑僝漙摶囀瑑剸饌譔塼縳諯嫥膞鱄恮甎篿瑼鄟腞蟤傳僎叀堟孨抟沌湍灷竱篹籑蒃襈"};
const unsigned char PY_mb_zhuang[]=  {"装状庄撞壮妆桩幢裝狀莊妝僮荘壯奘湷粧樁戇獞焋梉戆丬壵娤庒憧戅漴糚艟贑贛赣"};
const unsigned char PY_mb_zhui[]=  {"追坠缀锥椎赘骓墜隹畷甀倕埀惴缒箠綴縋錐硾贅娷騅諈醊餟錣醀腏鵻膇轛鑆垂揣槌沝磓礈笍致萑錗鎚隊隧"};
const unsigned char PY_mb_zhun[]=  {"准肫準谆凖迍埻啍窀屯忳甽諄稕訰旽宒綧圫淳湻盹純纯胗衠飩饨黱"};
const unsigned char PY_mb_zhuo[]=  {"着卓桌捉浊拙灼啄酌濯焯镯斫擢倬茁琢著涿晫剢彴濁浞诼禚斲鷟穱噣缴圴矠啅蹠斀灂椓蝃謶趠諑篧琸捔汋蠗櫡蠿棳鐲穛斮梲罬藋籗硺蓔鵫丵劅勺叕啜坧墌妰娺掇撯擆斱斵杓棁棹槕淖準炪烵犳狵窡窧箸籱繳聉肫蕞諁趵踔躅鉵鋜鐯"};
const unsigned char PY_mb_zi[]=  {"子字自紫资仔兹姿梓籽滋渍孜姊缁咨呲恣趑吱訾眦淄鲻滓笫孖谘龇呰資髭茲赀耔倳孳菑崰秭辎牸茈嵫粢剚锱沝釨姉胔芓秶諮栥玆漬澬緇鈭鎡訿貲薋胾眥觜鼒璾錙杍胏椔鄑穧輜矷紎齍蓻鶅齜鯔事吇啙嗞姕孶榟橴次泚洓湽甾疵禌秄稵茊茡葘虸赼趦跐載輺载鋅鍿锌镃頾頿鰦齊齐"};
const unsigned char PY_mb_zong[]=  {"总宗纵踪棕粽综鬃總腙縱偬枞総蹤倧綜傯惣嵕豵摠瘲蓯縦錝鬷昮艐椶愡潀蝬騣蓗鑁惾翪稯猣朡熧倊堫嵏嵸從捴揔搃樅潈潨熜燪猔疭碂磫糉緃緫緵縂葼踨鍯鏓騌骔鬉鯮鯼"};
const unsigned char PY_mb_zou[]=  {"走邹揍奏诹驺赱陬鄒鄹偢諏鲰楱掫搊棸齺緅郰菆棷媰騶鯫齱黀族箃芻鯐"};
const unsigned char PY_mb_zu[]=  {"组租足族祖阻卒卆俎組鏃崒诅镞菹伜鉏倅爼伹柤綷箤傶哫砠詛謯踿珇鉐怚靻蒩駔趲葅踤啐嘁岨崪徂沮淬稡紣苴趱蹴鉃錊鎐鎺鑿顇驵"};
const unsigned char PY_mb_zuan[]=  {"钻赚攥纂鑽欑缵躜纘篹鑚籫躦揝纉劗撮攒攢繤賺"};
const unsigned char PY_mb_zui[]=  {"最嘴罪醉咀蕞觜枠嶉脧厜晬嫢檇樶睟酔酨噿濢檌嗺嶵璻祽鋷嶊欈絊纗摧撮朘栬槯稡穝羧蟕辠酻錊雋"};
const unsigned char PY_mb_zun[]=  {"尊遵樽栫鐏鳟拵僔墫撙僎譐罇瀳繜嶟噂袸踆跧鱒銌捘鷷奠捽蹲鶎"};
const unsigned char PY_mb_zuo[]=  {"做作坐左座佐昨唑琢祚嘬凿酢怍鑿柞阼莋笮胙捽蓙稓鈼侳筰葃撮葄繓岝椊乍咗岞挫柮砟秨糳苲袏諎醋飵"};


/*英文输入查询码表*/
typedef struct
{
	const char* key;
	const char* Letter;

}T9EN_IDX;

const T9EN_IDX t9EN_index[] = {
		{"2","abcABC"},
		{"3","defDEF"},
		{"4","ghiGHI"},
		{"5","jklJKL"},
		{"6","mnoMNO"},
		{"7","pqrsPQRS"},
		{"8","tuvTUV"},
		{"9","wxyzWXYZ"}
};

/*拼音输入法查询码表*/
typedef struct
{
	const char *T9;
	const char *PY;
	const unsigned char *MB;
}T9PY_IDX;

const T9PY_IDX t9PY_index[] ={
				{"2","a",PY_mb_a},
				{"2","b",PY_mb_b},
				{"2","c",PY_mb_c},
				{"3","d",PY_mb_d},
				{"3","e",PY_mb_e},
				{"3","f",PY_mb_f},
				{"4","g",PY_mb_g},
				{"4","h",PY_mb_h},
				{"5","j",PY_mb_j},
				{"5","k",PY_mb_k},
				{"5","l",PY_mb_l},
				{"6","m",PY_mb_m},
				{"6","n",PY_mb_n},
				{"6","o",PY_mb_o},
				{"7","p",PY_mb_p},
				{"7","q",PY_mb_q},
				{"7","r",PY_mb_r},
				{"7","s",PY_mb_s},
				{"8","t",PY_mb_t},
				{"9","w",PY_mb_w},
				{"9","x",PY_mb_x},
				{"9","y",PY_mb_y},
				{"9","z",PY_mb_z},
				{"22","ba",PY_mb_ba},
				{"22","ca",PY_mb_ca},
				{"23","ce",PY_mb_ce},
				{"23","be",PY_mb_bei},
				{"24","ai",PY_mb_ai},
				{"24","bi",PY_mb_bi},
				{"24","ch",PY_mb_ch},
				{"24","ci",PY_mb_ci},
				{"26","co",PY_mb_cou},
				{"26","bo",PY_mb_bo},
				{"26","an",PY_mb_an},
				{"26","ao",PY_mb_ao},
				{"28","bu",PY_mb_bu},
				{"28","cu",PY_mb_cu},
				{"32","da",PY_mb_da},
				{"32","fa",PY_mb_fa},
				{"33","de",PY_mb_de},
				{"33","fe",PY_mb_fei},
				{"34","di",PY_mb_di},
				{"34","ei",PY_mb_ei},
				{"36","en",PY_mb_en},
				{"36","fo",PY_mb_fo},
				{"37","er",PY_mb_er},
				{"36","do",PY_mb_dou},
				{"38","du",PY_mb_du},
				{"38","fu",PY_mb_fu},
				{"42","ga",PY_mb_ga},
				{"42","ha",PY_mb_ha},
				{"43","ge",PY_mb_ge},
				{"43","he",PY_mb_he},
				{"46","go",PY_mb_gou},
				{"46","ho",PY_mb_hou},
				{"48","gu",PY_mb_gu},
				{"48","hu",PY_mb_hu},
				{"52","ka",PY_mb_ka},
				{"52","la",PY_mb_la},
				{"53","le",PY_mb_le},
				{"53","ke",PY_mb_ke},
				{"54","ji",PY_mb_ji},
				{"54","li",PY_mb_li},
				{"56","ko",PY_mb_kou},
				{"56","lo",PY_mb_lo},
				{"58","lu",PY_mb_lu},
				{"58","lv",PY_mb_lv},
				{"58","ju",PY_mb_ju},
				{"58","ku",PY_mb_ku},
				{"62","ma",PY_mb_ma},
				{"62","na",PY_mb_na},
				{"63","me",PY_mb_me},
				{"63","ne",PY_mb_ne},
				{"64","mi",PY_mb_mi},
				{"64","ni",PY_mb_ni},
				{"66","mo",PY_mb_mo},
				{"66","no",PY_mb_nou},
				{"68","mu",PY_mb_mu},
				{"68","nu",PY_mb_nu},
				{"68","nv",PY_mb_nv},
				{"68","ou",PY_mb_ou},
				{"72","pa",PY_mb_pa},
				{"72","pe",PY_mb_pei},
				{"72","ra",PY_mb_ran},
				{"72","sa",PY_mb_sa},
				{"73","re",PY_mb_re},
				{"73","se",PY_mb_se},
				{"74","pi",PY_mb_pi},
				{"74","qi",PY_mb_qi},
				{"74","ri",PY_mb_ri},
				{"74","sh",PY_mb_sh},
				{"74","si",PY_mb_si},
				{"76","so",PY_mb_sou},
				{"76","po",PY_mb_po},
				{"76","ro",PY_mb_rou},
				{"78","pu",PY_mb_pu},
				{"78","qu",PY_mb_qu},
				{"78","ru",PY_mb_ru},
				{"78","su",PY_mb_su},
				{"82","ta",PY_mb_ta},
				{"83","te",PY_mb_te},
				{"84","ti",PY_mb_ti},
				{"86","to",PY_mb_tou},
				{"88","tu",PY_mb_tu},
				{"92","wa",PY_mb_wa},
				{"92","ya",PY_mb_ya},
				{"92","za",PY_mb_za},
				{"93","ze",PY_mb_ze},
				{"93","ye",PY_mb_ye},
				{"94","yi",PY_mb_yi},
				{"94","xi",PY_mb_xi},
				{"94","zh",PY_mb_zh},
				{"94","zi",PY_mb_zi},
				{"96","zo",PY_mb_zou},
				{"96","wo",PY_mb_wo},
				{"96","yo",PY_mb_yo},
				{"98","wu",PY_mb_wu},
				{"98","xu",PY_mb_xu},
				{"98","yu",PY_mb_yu},
				{"98","zu",PY_mb_zu},
				{"224","bai",PY_mb_bai},
				{"224","cai",PY_mb_cai},
				{"226","can",PY_mb_can},
				{"226","cao",PY_mb_cao},
				{"226","ban",PY_mb_ban},
				{"226","bao",PY_mb_bao},
				{"234","bei",PY_mb_bei},
				{"236","ben",PY_mb_ben},
				{"236","cen",PY_mb_cen},
				{"242","bia",PY_mb_bian},
				{"242","cha",PY_mb_cha},
				{"243","che",PY_mb_che},
				{"243","bie",PY_mb_bie},
				{"244","chi",PY_mb_chi},
				{"246","bin",PY_mb_bin},
				{"246","cho",PY_mb_chou},
				{"248","chu",PY_mb_chu},
				{"264","ang",PY_mb_ang},
				{"266","con",PY_mb_cong},
				{"268","cou",PY_mb_cou},
				{"282","cua",PY_mb_cuan},
				{"284","cui",PY_mb_cui},
				{"286","cun",PY_mb_cun},
				{"286","cuo",PY_mb_cuo},
				{"324","dai",PY_mb_dai},
				{"326","dan",PY_mb_dan},
				{"326","dao",PY_mb_dao},
				{"326","fan",PY_mb_fan},
				{"334","fei",PY_mb_fei},
				{"336","fen",PY_mb_fen},
				{"336","den",PY_mb_deng},
				{"342","dia",PY_mb_dia},
				{"343","die",PY_mb_die},
				{"346","din",PY_mb_ding},
				{"348","diu",PY_mb_diu},
				{"366","don",PY_mb_dong},
				{"368","dou",PY_mb_dou},
				{"368","fou",PY_mb_fou},
				{"382","dua",PY_mb_duan},
				{"384","dui",PY_mb_dui},
				{"386","dun",PY_mb_dun},
				{"386","duo",PY_mb_duo},
				{"424","gai",PY_mb_gai},
				{"424","hai",PY_mb_hai},
				{"426","han",PY_mb_han},
				{"426","gan",PY_mb_gan},
				{"426","gao",PY_mb_gao},
				{"426","hao",PY_mb_hao},
				{"434","hei",PY_mb_hei},
				{"434","gei",PY_mb_gei},
				{"436","gen",PY_mb_gen},
				{"436","hen",PY_mb_hen},
				{"466","gon",PY_mb_gong},
				{"466","hon",PY_mb_hong},
				{"468","gou",PY_mb_gou},
				{"468","hou",PY_mb_hou},
				{"482","hua",PY_mb_hua},
				{"482","gua",PY_mb_gua},
				{"484","gui",PY_mb_gui},
				{"484","hui",PY_mb_hui},
				{"486","hun",PY_mb_hun},
				{"486","huo",PY_mb_huo},
				{"486","gun",PY_mb_gun},
				{"486","guo",PY_mb_guo},
				{"524","kai",PY_mb_kai},
				{"524","lai",PY_mb_lai},
				{"526","lan",PY_mb_lan},
				{"526","kan",PY_mb_kan},
				{"526","kao",PY_mb_kao},
				{"526","lao",PY_mb_lao},
				{"534","lei",PY_mb_lei},
				{"536","len",PY_mb_leng},
				{"536","ken",PY_mb_ken},
				{"542","jia",PY_mb_jia},
				{"542","lia",PY_mb_lia},
				{"543","jie",PY_mb_jie},
				{"543","lie",PY_mb_lie},
				{"546","lin",PY_mb_lin},
				{"546","jin",PY_mb_jin},
				{"546","jio",PY_mb_jiong},
				{"548","jiu",PY_mb_jiu},
				{"548","liu",PY_mb_liu},
				{"566","lon",PY_mb_long},
				{"566","kon",PY_mb_kong},
				{"568","kou",PY_mb_kou},
				{"568","lou",PY_mb_lou},
				{"582","lua",PY_mb_luan},
				{"582","kua",PY_mb_kua},
				{"582","jua",PY_mb_juan},
				{"583","jue",PY_mb_jue},
				{"583","lue",PY_mb_lue},
				{"584","kui",PY_mb_kui},
				{"586","lun",PY_mb_lun},
				{"586","luo",PY_mb_luo},
				{"586","kun",PY_mb_kun},
				{"586","kuo",PY_mb_kuo},
				{"586","jun",PY_mb_jun},
				{"624","mai",PY_mb_mai},
				{"624","nai",PY_mb_nai},
				{"626","nan",PY_mb_nan},
				{"626","man",PY_mb_man},
				{"626","mao",PY_mb_mao},
				{"626","nao",PY_mb_nao},
				{"634","nei",PY_mb_nei},
				{"634","mei",PY_mb_mei},
				{"636","nen",PY_mb_nen},
				{"636","men",PY_mb_men},
				{"642","mia",PY_mb_mian},
				{"642","nia",PY_mb_nian},
				{"643","mie",PY_mb_mie},
				{"643","nie",PY_mb_nie},
				{"646","nin",PY_mb_nin},
				{"646","min",PY_mb_min},
				{"648","miu",PY_mb_miu},
				{"648","niu",PY_mb_niu},
				{"666","non",PY_mb_nong},
				{"668","mou",PY_mb_mou},
				{"668","nou",PY_mb_nou},
				{"682","nua",PY_mb_nuan},
				{"683","nve",PY_mb_nve},
				{"686","nuo",PY_mb_nuo},
				{"724","pai",PY_mb_pai},
				{"734","pei",PY_mb_pei},
				{"724","sai",PY_mb_sai},
				{"726","san",PY_mb_san},
				{"726","pan",PY_mb_pan},
				{"726","pao",PY_mb_pao},
				{"736","pen",PY_mb_pen},
				{"726","ran",PY_mb_ran},
				{"726","rao",PY_mb_rao},
				{"726","sao",PY_mb_sao},
				{"736","sen",PY_mb_sen},
				{"736","ren",PY_mb_ren},
				{"742","pia",PY_mb_pian},
				{"742","qia",PY_mb_qia},
				{"742","sha",PY_mb_sha},
				{"743","pie",PY_mb_pie},
				{"743","qie",PY_mb_qie},
				{"743","she",PY_mb_she},
				{"744","shi",PY_mb_shi},
				{"748","shu",PY_mb_shu},
				{"746","qin",PY_mb_qin},
				{"746","pin",PY_mb_pin},
				{"746","qio",PY_mb_qiong},
				{"746","sho",PY_mb_shou},
				{"748","qiu",PY_mb_qiu},
				{"766","ron",PY_mb_rong},
				{"768","pou",PY_mb_pou},
				{"768","rou",PY_mb_rou},
				{"766","son",PY_mb_song},
				{"768","sou",PY_mb_sou},
				{"782","sua",PY_mb_suan},
				{"782","rua",PY_mb_ruan},
				{"782","qua",PY_mb_quan},
				{"783","que",PY_mb_que},
				{"784","rui",PY_mb_rui},
				{"784","sui",PY_mb_sui},
				{"786","sun",PY_mb_sun},
				{"786","suo",PY_mb_suo},
				{"786","run",PY_mb_run},
				{"786","ruo",PY_mb_ruo},
				{"786","qun",PY_mb_qun},
				{"824","tai",PY_mb_tai},
				{"826","tan",PY_mb_tan},
				{"826","tao",PY_mb_tao},
				{"836","ten",PY_mb_teng},
				{"842","tia",PY_mb_tian},
				{"843","tie",PY_mb_tie},
				{"846","tin",PY_mb_ting},
				{"866","ton",PY_mb_tong},
				{"868","tou",PY_mb_tou},
				{"882","tua",PY_mb_tuan},
				{"884","tui",PY_mb_tui},
				{"886","tun",PY_mb_tun},
				{"886","tuo",PY_mb_tuo},
				{"924","wai",PY_mb_wai},
				{"924","zai",PY_mb_zai},
				{"926","zan",PY_mb_zan},
				{"926","wan",PY_mb_wan},
				{"926","yan",PY_mb_yan},
				{"926","yao",PY_mb_yao},
				{"926","zao",PY_mb_zao},
				{"934","zei",PY_mb_zei},
				{"934","wei",PY_mb_wei},
				{"936","zen",PY_mb_zen},
				{"936","wen",PY_mb_wen},
				{"942","xia",PY_mb_xia},
				{"942","zha",PY_mb_zha},
				{"943","xie",PY_mb_xie},
				{"943","zhe",PY_mb_zhe},
				{"944","zhi",PY_mb_zhi},
				{"946","zho",PY_mb_zhou},
				{"946","xin",PY_mb_xin},
				{"946","xio",PY_mb_xiong},
				{"946","yin",PY_mb_yin},
				{"948","xiu",PY_mb_xiu},
				{"948","zhu",PY_mb_zhu},
				{"966","yon",PY_mb_yong},
				{"966","zon",PY_mb_zong},
				{"968","you",PY_mb_you},
				{"968","zou",PY_mb_zou},
				{"982","zua",PY_mb_zuan},
				{"982","yua",PY_mb_yuan},
				{"982","xua",PY_mb_xuan},
				{"983","xue",PY_mb_xue},
				{"983","yue",PY_mb_yue},
				{"984","zui",PY_mb_zui},
				{"986","zun",PY_mb_zun},
				{"986","zuo",PY_mb_zuo},
				{"986","yun",PY_mb_yun},
				{"986","xun",PY_mb_xun},
				{"2264","bang",PY_mb_bang},
				{"2364","beng",PY_mb_beng},
				{"2426","bian",PY_mb_bian},
				{"2426","biao",PY_mb_biao},
				{"2464","bing",PY_mb_bing},
				{"2264","cang",PY_mb_cang},
				{"2364","ceng",PY_mb_ceng},
				{"2424","chai",PY_mb_chai},
				{"2426","chan",PY_mb_chan},
				{"2426","chao",PY_mb_chao},
				{"2436","chen",PY_mb_chen},				
				{"2466","chon",PY_mb_chong},
				{"2468","chou",PY_mb_chou},
				{"2482","chua",PY_mb_chuai},
				{"2484","chui",PY_mb_chui},
				{"2486","chun",PY_mb_chun},
				{"2486","chuo",PY_mb_chuo},				
				{"2664","cong",PY_mb_cong},
				{"2826","cuan",PY_mb_cuan},
				{"3264","dang",PY_mb_dang},
				{"3264","fang",PY_mb_fang},
				{"3364","feng",PY_mb_feng},
				{"3364","deng",PY_mb_deng},
				{"3426","dian",PY_mb_dian},
				{"3426","diao",PY_mb_diao},
				{"3464","ding",PY_mb_ding},
				{"3664","dong",PY_mb_dong},
				{"3826","duan",PY_mb_duan},
				{"4264","gang",PY_mb_gang},
				{"4364","geng",PY_mb_geng},
				{"4664","gong",PY_mb_gong},
				{"4824","guai",PY_mb_guai},
				{"4826","guan",PY_mb_guan},
				{"4264","hang",PY_mb_hang},
				{"4364","heng",PY_mb_heng},
				{"4664","hong",PY_mb_hong},
				{"4824","huai",PY_mb_huai},
				{"4826","huan",PY_mb_huan},
				{"5264","kang",PY_mb_kang},
				{"5264","lang",PY_mb_lang},
				{"5364","leng",PY_mb_leng},
				{"5364","keng",PY_mb_keng},
				{"5426","lian",PY_mb_lian},
				{"5426","liao",PY_mb_liao},
				{"5426","jian",PY_mb_jian},
				{"5426","jiao",PY_mb_jiao},
				{"5464","jing",PY_mb_jing},
				{"5464","ling",PY_mb_ling},
				{"5466","jion",PY_mb_jiong},
				{"5664","long",PY_mb_long},
				{"5664","kong",PY_mb_kong},
				{"5824","kuai",PY_mb_kuai},
				{"5826","kuan",PY_mb_kuan},
				{"5826","luan",PY_mb_luan},
				{"5826","juan",PY_mb_juan},
				{"6264","mang",PY_mb_mang},
				{"6264","nang",PY_mb_nang},
				{"6364","meng",PY_mb_meng},
				{"6364","neng",PY_mb_neng},
				{"6426","mian",PY_mb_mian},
				{"6426","miao",PY_mb_miao},
				{"6426","nian",PY_mb_nian},
				{"6426","niao",PY_mb_niao},
				{"6464","ming",PY_mb_ming},
				{"6464","ning",PY_mb_ning},
				{"6664","nong",PY_mb_nong},
				{"6826","nuan",PY_mb_nuan},
				{"7264","pang",PY_mb_pang},
				{"7364","peng",PY_mb_peng},
				{"7264","rang",PY_mb_rang},
				{"7264","sang",PY_mb_sang},
				{"7364","seng",PY_mb_seng},
				{"7364","reng",PY_mb_reng},
				{"7424","shai",PY_mb_shai},
				{"7426","shan",PY_mb_shan},
				{"7426","shao",PY_mb_shao},
				{"7426","pian",PY_mb_pian},
				{"7426","piao",PY_mb_piao},
				{"7426","qian",PY_mb_qian},
				{"7426","qiao",PY_mb_qiao},
				{"7436","shen",PY_mb_shen},
				{"7464","ping",PY_mb_ping},
				{"7464","qing",PY_mb_qing},
				{"7466","qion",PY_mb_qiong},
				{"7468","shou",PY_mb_shou},
				{"7482","shua",PY_mb_shua},
				{"7484","shui",PY_mb_shui},
				{"7486","shun",PY_mb_shun},
				{"7486","shuo",PY_mb_shuo},
				{"7664","rong",PY_mb_rong},
				{"7664","song",PY_mb_song},
				{"7826","suan",PY_mb_suan},
				{"7826","quan",PY_mb_quan},
				{"7826","ruan",PY_mb_ruan},
				{"8264","tang",PY_mb_tang},
				{"8364","teng",PY_mb_teng},
				{"8426","tian",PY_mb_tian},
				{"8426","tiao",PY_mb_tiao},
				{"8464","ting",PY_mb_ting},
				{"8664","tong",PY_mb_tong},
				{"8826","tuan",PY_mb_tuan},
				{"9264","wang",PY_mb_wang},
				{"9264","zang",PY_mb_zang},
				{"9264","yang",PY_mb_yang},
				{"9364","weng",PY_mb_weng},
				{"9364","zeng",PY_mb_zeng},
				{"9424","zhai",PY_mb_zhai},
				{"9426","zhan",PY_mb_zhan},
				{"9426","zhao",PY_mb_zhao},
				{"9426","xian",PY_mb_xian},
				{"9426","xiao",PY_mb_xiao},
				{"9436","zhen",PY_mb_zhen},
				{"9464","xing",PY_mb_xing},
				{"9464","ying",PY_mb_ying},
				{"9466","zhon",PY_mb_zhong},
				{"9468","zhou",PY_mb_zhou},
				{"9482","zhua",PY_mb_zhua},
				{"9484","zhui",PY_mb_zhui},
				{"9486","zhun",PY_mb_zhun},
				{"9486","zhuo",PY_mb_zhuo},
				{"9466","xion",PY_mb_xiong},
				{"9664","yong",PY_mb_yong},
				{"9664","zong",PY_mb_zong},
				{"9826","yuan",PY_mb_yuan},
				{"9826","xuan",PY_mb_xuan},
				{"9826","zuan",PY_mb_zuan},
				{"94264","xiang",PY_mb_xiang},
				{"94264","zhang",PY_mb_zhang},
				{"94364","zheng",PY_mb_zheng},
				{"94664","xiong",PY_mb_xiong},
				{"94664","zhong",PY_mb_zhong},
				{"94824","zhuai",PY_mb_zhuai},
				{"94826","zhuan",PY_mb_zhuan},				
				{"24264","chang",PY_mb_chang},				
				{"24364","cheng",PY_mb_cheng},
				{"24664","chong",PY_mb_chong},
				{"24824","chuai",PY_mb_chuai},
				{"24826","chuan",PY_mb_chuan},
				{"48264","guang",PY_mb_guang},
				{"48264","huang",PY_mb_huang},
				{"54264","jiang",PY_mb_jiang},
				{"54264","liang",PY_mb_liang},
				{"54664","jiong",PY_mb_jiong},
				{"58264","kuang",PY_mb_kuang},
				{"64264","niang",PY_mb_niang},
				{"74264","qiang",PY_mb_qiang},
				{"74264","shang",PY_mb_shang},
				{"74364","sheng",PY_mb_sheng},
				{"74664","qiong",PY_mb_qiong},
				{"74824","shuai",PY_mb_shuai},
				{"74826","shuan",PY_mb_shuan},
				{"248264","chuang",PY_mb_chuang},
				{"748264","shuang",PY_mb_shuang},
				{"948264","zhuang",PY_mb_zhuang},
				{"","",PY_mb_space}
};

#endif
